{
  "reviewsByProperty": {
    "Cozy Cactus": [
      {
        "date": "2026-01-04T15:12:52.165Z",
        "rating": 5,
        "comment": "The Cozy Cactus is indeed cozy 😀. A spacious house that's tastefully decorated, refreshingly free of the usual cheap or chintzy furnishings found in other Airbnb rentals. It's well stocked with supplies.\n\nEverything is well labeled so easy to find what we need. The hot tub was great with the cool weather.\n\nEann is a super host, very accommodating and helpful, and extremely responsive.  Average Response Time is given as one hour, but in reality, averaged less than a minute!\n\nIf you're planning to attend Coachella, and do things around La Quinta, Palm Desert, etc, this is a super location. We did a lot in Palm Springs and the drive was somewhat too long to be convenient (averaged 50 min to an hour)\n\nProperty is within a gated community so felt very safe. It has pools, fitness center and even pickleball courts. Getting in and out of the security gate was easy. We did not have any issues as shared in some reviews.\n\nWe had a great stay.",
        "privateFeedback": "A few things that can use some improvements:\n- the sliding glass doors and screens (from both kitchen and MBR) to the backyard are difficult to open and close. Something wrong with the sliding mechanism. \n- The smoker is great but would be easier and quicker with a gas grill.\n- the hot tub is great and clean but water should be drained and tub refilled. It was very foamy from water not being changed out. Monitor indicated age of water!\n- the curtain rod in MBR (by sliding glass door) kept falling down when we opened and closed curtains\n- would be helpful to have more towel rods in bathrooms for wet towels",
        "categoryRatings": {
          "VALUE": 5,
          "CHECKIN": 5,
          "LOCATION": 4,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-12-27T00:13:13.480Z",
        "rating": 5,
        "comment": "The house is beautiful! It is just as pictured, even better in person. Had everything we needed, easy to find, everything in the home is labeled and in a proper place. Very clean and cute decor and set up, perfect for our family!",
        "privateFeedback": "Thank you for a great stay!  Great communication and information.",
        "categoryRatings": {
          "VALUE": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "LOCATION": 4
        }
      },
      {
        "date": "2025-12-26T01:02:01.957Z",
        "rating": 5,
        "comment": "I can't think of a better Airbnb experience and a nicer host who was always available if you needed something or had any questions. Thankyou very much, Eann.",
        "privateFeedback": "Hi Eann. We had a wonderful time. Your rapid responses were welcome. Please take care, and Happy New Year in advance \n\nOn a side note, I saw part of your name, Tuan,  and thought that perhaps you have Vietnamese ancestry. I lived in Asia as a teacher for more than 40 years, and Vietnam 7. years. Anyway, I try to put names with countries.\n\nThankyou again, Eann.",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-12-24T04:31:56.039Z",
        "rating": 5,
        "comment": "Eann is a wonderful host, very responsive and kind. The house is also great, exactly like in the photos and description. we loved all the amenities, hot tub, mini golf and just everything. The shared swimming pool and pickleball were great fun for the whole family. We will definitely come back if we are in the area again!",
        "privateFeedback": "",
        "categoryRatings": {
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2025-12-18T03:29:02.513Z",
        "rating": 5,
        "comment": "The location was great, and it was very comfortable to use. The TV was large, and there were good seasonings and utensils well prepared for cooking.",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-12-12T05:31:38.277Z",
        "rating": 5,
        "comment": "This lovely place had everything we needed. The heated pool was a hit with our family, and the comfortable, clean, and well-stocked apartment made it a great place to stay. The location is also great, being close to shops and a grocery store, and a short drive to downtown Palm Springs. Highly recommended if you’re visiting Palm Springs.",
        "privateFeedback": "Thanks again for having us Eann.",
        "categoryRatings": {
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2025-12-11T05:16:25.872Z",
        "rating": 5,
        "comment": "The best host I've had so far! Amazing from start to finish thank you so much! We will be back soon!",
        "privateFeedback": "Thank You! So much for for everything, you have been wonderful thank you!",
        "categoryRatings": {
          "ACCURACY": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2025-12-03T13:50:14.586Z",
        "rating": 5,
        "comment": "We had a great stay at Eann’s place! Beautiful home with lots of amenities. The kitchen was very well stocked which allowed us to celebrate a great Thanksgiving. And my toddler loved the mini golf green in the backyard. Thank you for a wonderful stay!",
        "privateFeedback": "Thank you for a great stay! We had a blast!",
        "categoryRatings": {
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "VALUE": 4,
          "CHECKIN": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2025-12-03T00:04:44.853Z",
        "rating": 5,
        "comment": "Very nice place, the host is very welcoming and attentive i would stay again",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-11-20T02:54:23.112Z",
        "rating": 5,
        "comment": "Eann’s home in Indio was perfect for our family of 5! We have young kids and her house was stocked with everything you could need for babies (changing table, high chair, pack n play, etc.) and even had some fun toys and games for our toddlers. The house was very well appointed and had everything we needed from kitchen appliances to coffee to laundry pods. The community was beautiful, had fun pools and was near by to many local attractions. Eann was incredibly responsive and helpful. 10/10 would recommend!",
        "privateFeedback": "Thanks Eann for the fabulous stay! If we ever come back to Indio we would absolutely seek out your house again. It didn’t feel like a cheap Airbnb flip, it really felt like a home and was perfectly cozy, close to things and full of fun stuff for the kids. Appreciate you helping us with guests/gate lists and being so understanding about the pack n play situation.",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "CHECKIN": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2025-11-13T19:05:46.466Z",
        "rating": 5,
        "comment": "Great stay. Clean with quality furniture. Well decorated. Well stocked kitchen - loved the coffee bar! Foosball table got alot of use. Traegar smoker was a high end bonus. Highly recommended.",
        "privateFeedback": "You were the best host we've had. Lovely space and great communication.  Thank you!",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-11-13T16:50:53.327Z",
        "rating": 5,
        "comment": "I had a wonderful stay here with my cat and would choose this airbnb again. The space was comfortable, homey, and very clean. I appreciated how Eann provided thoughtful instructions on the apartment, its ample amenities, and things to do in the surrounding city.  She was a kind and highly responsive host who made my time here seamless and enjoyable. One example of this was during my stay, when I noticed the keurig wasn't working. She responded quickly and had a new keurig delivered to the house within half a day. Overall, I was so appreciative and happy here and she is an incredible host.",
        "privateFeedback": "Thank you so much Eann - me and Leo felt like we were at home in this space and appreciated your hospitality and kindness :)",
        "categoryRatings": {
          "ACCURACY": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2025-11-13T03:53:54.650Z",
        "rating": 5,
        "comment": "The place is great, as advertised, clean, well-equipped, and while we had one small problem manifest while we were there, Eann handled it efficiently and quickly, even though it was a Saturday night. Great beds and the pool and hot tub are real nice, and close. \n\nI highly recommend this apartment!",
        "privateFeedback": "just thanks again for your considerations, Best...",
        "categoryRatings": {
          "LOCATION": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2025-11-11T03:34:21.225Z",
        "rating": 4,
        "comment": "The aesthetics and design of the cozy apartment were  very well thought out and stylish. Loved  the great wallpaper choices to really spice up the feel of the place!\nWell appointed kitchen and everything you need!\nNice office set up and plenty closet space. Great water pressure in the main bedroom/bath shower.\nNice washer and dryer.Comfy bed too! \nThe location worked well for our needs on this trip and what we were doing.",
        "privateFeedback": "Condo review: We did love our stay at your place, but did find a few things that probably should be brought to your attention. \n1.There were coffee grounds in the paper filter of the coffee pot on arrival.\n2.Patio extremely dirty. Heavy dirt in the corners.\n3.The washer and dryer were filthy on the outside surfaces. So we cleaned them before use.\n4.Hardly any water pressure in small hall bathroom shower and sink.\n5.Nepresso  coffee maker didn't work for us at all.\n6.Toilet seat loose in the bigger bedroom bathroom.\n7.The rugs were looking like they need replacement or better cleaning.\n8.Lamp shade on wicker base (in big bedroom) needs repair or something as it does not look straight at all. It tilts to the side.\n9.The shower drain was not draining fast as I stood in a good inch of water.(Larger bedroom \nbathroom).\n10. Base boards were very dusty. Probably a paint with a smoother finish would decrease dust \ncollection and make it easier to clean. Noticed that on the shutters also.",
        "categoryRatings": {
          "CHECKIN": 5,
          "VALUE": 4,
          "LOCATION": 4,
          "CLEANLINESS": 4,
          "COMMUNICATION": 5,
          "ACCURACY": 4
        }
      },
      {
        "date": "2025-11-03T04:16:47.457Z",
        "rating": 5,
        "comment": "Wonderful & beautifully chic little desert abode! We loved all the family friendly amenities which made our trip so much easier & the kids had a blast, but it was also so cutely styled I could’ve seen myself visiting with a bunch of friends for a girls trip too. Very clean, organized (even drawers labeled), and Eann was so responsive & helpful!",
        "privateFeedback": "Thanks so much Eann for a wonderful stay! Everything was excellent, and I’m taking so many design inspo notes home with me in mind, ha. The only thing I would’ve suggested is in the master bedroom, the curtains aren’t dark enough to block out the streetlight (or neighbor’s light?) that shines through at night. My husband’s one note was that the master bed has gotten a bit extra soft (I still slept well but I think the master bed has had more wear than the other ones, rightfully so because of the beautiful space). Overall, I’d def recommend your place to anyone! We LOVED all the baby amenities which truly saved us from packing so much, and the foosball, putting green and pool amenities were all amazing. Thanks again!",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2025-10-26T18:51:15.318Z",
        "rating": 4,
        "comment": "It was a great stay. Eann's place felt like home. It was decorated nicely, clean and cozy. It had everything you ever needed in the unit. I would not hesitate renting from Eann. She was soo great to deal with. Always answered promptly and was so accommodating. Eann - you are one of the best hosts we've dealt with. Thank you so much for everything!!",
        "privateFeedback": "Hi Eann - you were so awesome. Just a couple reasons we would not rent that unit again would be the pool was sooo cold and it was hard to carry those loungers back and forth too. I love to swim but I could not just get in that pool past my knees. Also, the grounds around the unit were were very dirty. Even cobwebs up the stairs to the unit. Also it really smelled like pee as soon as you turn the corner to go to the unit. I'm not sure why? That being said you were one of the best hosts we've ever dealt with! Thank you so much for everything!",
        "categoryRatings": {
          "LOCATION": 4,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "ACCURACY": 4
        }
      },
      {
        "date": "2025-10-20T01:20:48.910Z",
        "rating": 5,
        "comment": "Everything was great. Great home, great facilities to use, great host. We have no complaints and hope to stay again!\n\nComfortably fit 7 people :)",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "ACCURACY": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2025-09-29T17:27:55.258Z",
        "rating": 5,
        "comment": "We booked this Airbnb for my friend's wedding and loved it because it had touches of pink which went perfect with her theme. The master bedroom was huge and loved it and the space made it easy for us girls to get ready in. Easy to get there and very clear instructions. The place looked exactly like the pictures and even prettier in person. Thank you so much and would definitely recommend.",
        "privateFeedback": "Thank you for everything, everything was perfect.",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2025-09-28T21:19:02.499Z",
        "rating": 5,
        "comment": "I really only the greatest things to say about Eann home and how great she was. Everything was over the top perfect! \n\nI can’t wait to come back! 🌊",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2025-09-25T03:51:05.465Z",
        "rating": 5,
        "comment": "Eann's place was absolute perfection. From the carefully labeled switches and drawers to the awesome coffee bar and even more awesome hot tub and mini golf setup, this place had everything. The layout is perfect for families, there was an abundance of towels, the mattresses were super comfortable. It really had everything you could ever want. I joked that I'd have to drag my kids out, but I practically did. We loved the place and can't wait to come back.",
        "privateFeedback": "Truly a gem of a place, you've thought of everything!",
        "categoryRatings": {
          "LOCATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2025-09-18T03:24:04.261Z",
        "rating": 3,
        "comment": "Place was okay, it wasn’t what I expected based upon the pictures…",
        "privateFeedback": "I’d say that if there is anything that needs to be fixed for it to be done before arrival. We had an issue with couches and the master bed felt like it sunk in the middle as me and my wife were trying to rest. As well as possibly a tv in the master bedroom.",
        "categoryRatings": {
          "CLEANLINESS": 4,
          "VALUE": 3,
          "CHECKIN": 5,
          "LOCATION": 5,
          "ACCURACY": 3,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2025-09-12T21:54:10.302Z",
        "rating": 5,
        "comment": "We had a wonderful time at the cozy cactus. The house was clean, and equipped with everything you needed, especially if you are staying with children. The kitchen was also filled with everything you needed, for cooking, drinking coffee, making coffee, and even things for the little ones. We really enjoyed our time here and I highly recommend it to anyone visiting the desert.",
        "privateFeedback": "Everything was wonderful but I did notice the little charging station were the ipod was, didn’t work.  maybe there was an outlet issue. Other than that everything was wonderful.",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-09-02T22:08:05.238Z",
        "rating": 5,
        "comment": "We had a great time at Eann’s place!  We’ll definitely come back!",
        "privateFeedback": "",
        "categoryRatings": {
          "VALUE": 5,
          "CHECKIN": 5,
          "LOCATION": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2025-08-25T19:10:39.947Z",
        "rating": 5,
        "comment": "Wow! It was such a beautiful stay at the Cozy Cactus. Thank you so much Eann for providing the best hospitality to my friends and I💓\nWe had a blast and will definitely be returning!",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-08-22T16:45:05.665Z",
        "rating": 5,
        "comment": "Our stay was absolutely perfect! The host was incredibly responsive and made everything smooth from start to finish. The home itself was spotless, beautifully maintained, and thoughtfully organized. Every cabinet was clearly labeled, which made settling in so easy. There were plenty of activities both inside the home and nearby, so whether we wanted to relax or explore, we always had options. This was one of the best Airbnb experiences we’ve ever had, and I would highly recommend this host and home to anyone looking for a comfortable and enjoyable stay!",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-08-11T19:02:38.479Z",
        "rating": 5,
        "comment": "Eann was so responsive and easy to speak to. So friendly and very willing to accommodate and help. The place was quiet, private and comfortable. Definitely recommend if you’re looking to stay in Indio/Palm Springs area!",
        "privateFeedback": "Thank you for the comfortable stay. You were a great host and appreciate the quick response time and willing to accommodate our early check in.",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2025-08-05T22:32:23.025Z",
        "rating": 5,
        "comment": "I wonderful peaceful place to gateway from. the big city noise. welcoming home as described on the profile.  Pool nice fresh,  perfect for the hot weather. Pool area only one house away! perfect 🥰 my daughter's really enjoyed it. thank you",
        "privateFeedback": "your home was absolutely beautiful and peaceful.  my daughter's enjoyed all your hone amenities special the Foosball table! thank you 😊!",
        "categoryRatings": {
          "VALUE": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2025-08-01T20:17:07.313Z",
        "rating": 5,
        "comment": "This is one of the best places our family has stayed in the entire time we’ve been using Air BNB. The house was immaculate and had everything we needed to have a great time. Eann was fast to respond when we had questions, and the place looked exactly like the listing. The highlight was the pool that was 1/2 a block away, the kids spent 2-3hrs there every day. We would come back and stay again and again",
        "privateFeedback": "Thanks for the amazing place, it was truly one of the best houses we’ve stayed at when using Airbnb.",
        "categoryRatings": {
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2025-07-21T21:43:53.807Z",
        "rating": 5,
        "comment": "We had a great time and used the pool every day.",
        "privateFeedback": "",
        "categoryRatings": {
          "VALUE": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "LOCATION": 4
        }
      },
      {
        "date": "2025-07-15T22:13:00.453Z",
        "rating": 5,
        "comment": "Perfect place to stay for a quick getaway with friends. Eann was nothing but kind, accommodating and responsive. Would love to use again the next time we have a big trip to the desert!",
        "privateFeedback": "No notes 11/10 stay. Thank you!!",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2025-07-01T18:10:04.139Z",
        "rating": 5,
        "comment": "This house was perfect for a weekend trip in the desert with my family with little kids. We loved the near by pool and private hot hub. House is well kept. The baby items were great. Felt just like home. I would go back again. Thank you Eann!",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2025-06-15T02:32:08.299Z",
        "rating": 5,
        "comment": "房子和照片一样，住在这里购物也很方便，旁边就超市，旁边就有球场。有问题反馈及时。",
        "privateFeedback": "床单好像不是新换的，上面有头发",
        "categoryRatings": {
          "CHECKIN": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2025-06-11T04:08:11.142Z",
        "rating": 5,
        "comment": "Loved this stay! Felt like home. It’s a quiet neighborhood which was really nice. We really loved the location too - felt like we were in the middle of anywhere we wanted to go! It has all the amenities you could ever need and they’re good quality too. You can tell Eann really cares about her guests’ stay. It’s super roomy and clean. Loved the showers and the bed was comfy too! Eann was extremely reliable and really quick to respond to any questions I had. We even had to extend our stay 4 days because we loved it so much! We would definitely stay again.😊",
        "privateFeedback": "Thank you so much, we loved our time at your place! We needed that more than you know! 😊",
        "categoryRatings": {
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2025-06-03T20:54:14.030Z",
        "rating": 5,
        "comment": "AMAZING AIRBNB!! We had such a blast. It felt like a home away from home and the bed was so comfortable. Ideal location, about a 10 minute drive to the strip. 10/10 would come back again! \n\nYou may also get a picture or 2 of Eann’s corgi if you’re lucky 💕",
        "privateFeedback": "Thank you so much!!",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2025-05-27T03:32:28.678Z",
        "rating": 5,
        "comment": "The cozy cactus was fantastic. It had many thoughtful touches throughout and was stalked with everything you could imagine. Extremely toddler friendly. Our kids loved the mini golf in the backyard and the pool right next door.\nThe welcome book was extremely informative and detailed.\nThank you, Eann for a wonderful stay. We will definitely be back!",
        "privateFeedback": "Thank you Eann for a wonderful stay. I appreciate the detailed welcome book and all the thoughtful touches in your home. My mom was so impressed and is still raving about it.",
        "categoryRatings": {
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-05-20T19:11:38.502Z",
        "rating": 5,
        "comment": "muy bonito departamento y excelente anfitrión",
        "privateFeedback": "",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-05-12T00:45:06.307Z",
        "rating": 5,
        "comment": "Great house, great host, great weekend!  Thank you for everything, truly a lovely home.",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2025-04-30T17:21:20.713Z",
        "rating": 5,
        "comment": "Super clean space and responsive host. Perfect place for two couples.",
        "privateFeedback": "Thank you Eann!",
        "categoryRatings": {
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2025-04-28T22:12:41.546Z",
        "rating": 5,
        "comment": "Our stay at the Cozy Cactus was exceptional! Eann was such a great host and so responsive whenever we had any questions!",
        "privateFeedback": "Thanks for a great stay!!",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2025-04-16T18:43:30.377Z",
        "rating": 5,
        "comment": "We stayed here for Coachella. The shuttle was approximately 20 min easy drive, close to Target and Starbucks and other places to eat. Kitchen was stocked for us to make late night snacks and breakfast. Great host.",
        "privateFeedback": "I couldn’t find sheets for the couch or pillow slips. Coffee cups were only decaf. Other than that great stay",
        "categoryRatings": {
          "LOCATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2025-04-10T22:20:35.454Z",
        "rating": 5,
        "comment": "We had a great stay! The place was spotless and looked just like the pictures. Eann was super friendly and responded to messages lightning fast. The trip is exactly what we were hoping for (:",
        "privateFeedback": "",
        "categoryRatings": {
          "VALUE": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-04-07T23:04:09.057Z",
        "rating": 5,
        "comment": "Really enjoyed Eann’s place. The location was great and the place was comfortable, beautiful, and clean; would definitely stay again. Eann answered all of our questions and was very responsive on messages. The suite had everything we could ever need and was fully stocked - cleaning supplies, great shampoo/conditioner, beach towels, reusable containers for leftovers, and so many spices for cooking. We were so happy with our stay - thanks Eann!",
        "privateFeedback": "Hi Eann, loved the place! Just wanted to point out a few things that may/may not have been brought to your attention. There were a couple of stains on the couch - should come out easily with an upholstery cleaner, the dishwasher would lean forward when there was weight on the door, and the second bedroom tv remote didn’t have batteries - purchased two AAA (all good, but in case they go missing again it wasn’t us). Thanks for the great memories and really enjoyed your place!",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-04-01T03:04:29.433Z",
        "rating": 5,
        "comment": "We had a wonderful 2 month stay at Eann's condo, our first visit to Palm Springs. The description in the listing says it all. The condo is extremely well equipped. The kitchen had everything thing we needed and more. The washer and dryer was much appreciated. Being one who grew up in the 60's, really liked the record player. The Sonos speaker was very nice to have. The covered parking kept the car cool in the sun. We and our standard poodle enjoyed the green grass. Eann was always super responsive whenever we needed to contact her. This condo is most likely the nicest one in the complex.",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2025-03-31T19:29:20.277Z",
        "rating": 5,
        "comment": "Great stay in Palm Springs with two toddlers. Everything as described and host provided clear instructions for everything. Clean, stocked and even had a pack-and-play! The pool was gorgeous, 1min walk (and heated!). A quick drive to downtown, hiking, zoo, playgrounds and grocery. Thanks for a great stay.",
        "privateFeedback": "Everything was great, thank you.",
        "categoryRatings": {
          "LOCATION": 4,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-03-26T17:20:13.945Z",
        "rating": 5,
        "comment": "We had an amazing time at this air bnb . By far one of the best properties I have ever stayed at. The pictures are extremely accurate, and everything is as described. Eann is an excellent host who corresponds extremely fast to every query. She was always helpful and responsive. Everything in her home is labeled and easy to figure out, even for seniors like us. The neighbourhood in Indian Palms is very friendly and well maintained. We also had our granddaughter and her parents come down for a week. This house is extremely friendly for a young toddler. The pool is just a few feet away, high chair and various other child items were available. Not a lot of air bnbs supply these items, a big plus for my daughter who got to pack a little less. In addition a lot of people have complaints about how long it takes to get through the gates at Indian Palms… no issue here!! And this is a huge plus ,Eann has a transponder so take it with you and it opens the gates for you.",
        "privateFeedback": "Eann you do a great job as a host! One suggestion I would make is ensure your housekeeping say every second cleaning runs the bath mats etc through the washing machine . And also every time checks and cleans the bbq grill. Thank you again!",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "LOCATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2025-03-23T23:25:55.569Z",
        "rating": 5,
        "comment": "Eann’s place was the best Airbnb we’ve ever stayed at!!!  Well appointed with basic staples in the kitchen! We could cook a meal and have most cupboard ingredients readily available!  (Unheard of in previous rentals).  Eann went above and beyond to make our stay outstanding!  We loved the unit and the beautiful pool was just steps away.  Eann really cares about her guests and it shows.  Outstanding!!!",
        "privateFeedback": "We absolutely loved our stay in your unit!!!  You were the BEST!!!!\nCan’t wait to come back next year!!!",
        "categoryRatings": {
          "ACCURACY": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2025-03-12T15:16:22.252Z",
        "rating": 5,
        "comment": "Amazing communication - unreal helpful and a great house on top. We loved it.",
        "privateFeedback": "",
        "categoryRatings": {
          "ACCURACY": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2025-03-11T17:02:13.924Z",
        "rating": 5,
        "comment": "This home was perfect for what we needed, and we will def be back!",
        "privateFeedback": "Hi Eann, just to let you know the power outlets in the ensuite don’t seem to work. Not sure if there was a switch that controls these but couldn’t find it.",
        "categoryRatings": {
          "ACCURACY": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2025-03-11T16:30:20.702Z",
        "rating": 5,
        "comment": "Lovely place and great host!\nThank you.",
        "privateFeedback": "",
        "categoryRatings": {
          "ACCURACY": 5,
          "CHECKIN": 5,
          "VALUE": 4,
          "COMMUNICATION": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2025-03-03T12:15:57.710Z",
        "rating": 5,
        "comment": "Eann’s place was exactly as advertised, beautifully renovated and had all the kitchen and home comforts you could need. Very clean and more spacious rooms than they looked online! Eann was great to communicate with, very responsive and her detailed instructions for accessing the unit made entry super easy. The complex itself is clearly older but Eann’s unit is pristine and was perfect for us as we were visiting family nearby. Super close to Trader Joe’s and other necessities. We didn’t actually use the pool area because it was so busy but she had pool towels and noodles and such at the ready. All in all, a good spot for a reasonable price during Modernism week (busy time to go with not a lot available).",
        "privateFeedback": "Thanks Eann for a great stay!",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "VALUE": 4,
          "CHECKIN": 5,
          "LOCATION": 4,
          "CLEANLINESS": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-03-02T03:19:37.295Z",
        "rating": 5,
        "comment": "A beautiful house in a gated community in Indio. Very peaceful and great HOA amenities. In addition to being super responsive and having a well-stocked house for adults and children of all ages, Eann put in small thoughtful touches like a transponder to open the gates automatically allowing us to enter via any entrance to the HOA, and not have to wait in line at main security. Thanks for a great vacation Eann!",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2025-02-10T22:52:39.015Z",
        "rating": 5,
        "comment": "Absolutely stunning property. Spacious, amazing coffee bar, hot tub etc.Eann has really made the whole place so nice and feels like home. Will be back soon and Would highly recommend!",
        "privateFeedback": "THANK YOU AGAIN!! WE HAD A BLAST AND HOPE TO BE BACK SOON. PERFECT LOCATION!",
        "categoryRatings": {
          "ACCURACY": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2025-02-07T19:33:20.960Z",
        "rating": 5,
        "comment": "We had the perfect weekend getaway and LOVED Eann’s place. It was absolutely prefect and had everything we needed. She has done a wonderful job with little touches making everything easy and convenient. We got to use the putting green and hot tub and it was great. The 10pm noise curfew was a little annoying but we made it work just fine. It is very close to other neighbors so we were happy to oblige. Thanks a bunch Eann!",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2025-02-03T12:59:05.274Z",
        "rating": 5,
        "comment": "Eann’s condo in Palm Springs is lovely.\nPerfectly suited for two couples or a family. \nThe two bedrooms and two bathrooms are private from the living room/dining area and kitchen.\nThe kitchen is fully equipped for cooking. Every utensil/appliance is in great shape.\nThe balcony is very private.\nLocation is fabulous, 35 minutes from Palm Desert, 45 minutes from Joshua Tree.\nMore than enough restaurants in PS, but Trader Joe’s is three minutes away. Fabulous food, great prices. Fun to cook in Eann’s kitchen.\nPool and Hot Tub are beautiful. Parking onsite.\nI highly recommend staying at Eann’s condo in Palm Springs.",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2025-01-27T17:37:56.229Z",
        "rating": 5,
        "comment": "She's a top-notch host and very accommodating to our special needs which included my pet. Place is beautifully designed everything you could possibly want is there and the coolest steps away and very quiet.  We left the location and the spacious accommodations.",
        "privateFeedback": "Thanks again for everything. Hope the review will do what it's intended to do.",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2025-01-16T06:35:00.203Z",
        "rating": 5,
        "comment": "My family and I had such an amazing and memorable stay at the Cozy cactus. It not only checked all the boxes for a family friendly getaway it exceeded all of our expectations. RUN DONT WALK to stay at this lovely spot. Great recommendations for fun and food and family friendly experiences.  It definitely won't be the last time we'll be there!",
        "privateFeedback": "Eann, you were the most marvelous host. The Cozy cactus really sheltered us in our time of need and that's a debt I can't repay. As I Mentioned WE LOVED every detail. thank you for everything. we can't wait to return again and make more memories there..",
        "categoryRatings": {
          "ACCURACY": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2025-01-13T23:06:47.435Z",
        "rating": 5,
        "comment": "Ran was very response to all questions and lovely to deal with.  The location was perfection.",
        "privateFeedback": "",
        "categoryRatings": {
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2025-01-09T17:59:52.478Z",
        "rating": 5,
        "comment": "It was a truly wonderful stay! The place is beautiful and stylish, spacious, and it is surrounded by plenty of places to walk your dog. Eann responded quickly and kindly to all of my questions (most of which were unnecessary lol), and she was a true pleasure to speak with. I highly recommend!",
        "privateFeedback": "Thank you for such a lovely experience, Eann! You helped make my, my husband's, and Sweetie's Christmas bright and full of cheer!\n\nWishing you all the best!",
        "categoryRatings": {
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2025-01-04T01:29:12.865Z",
        "rating": 5,
        "comment": "We loved the place. We would definitely stay again and highly recommend it!",
        "privateFeedback": "Thank you for your wonderful place. We so enjoyed ourselves! \nIt’s a great spot. I hope you will be available next year when we come back to the area!",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "CHECKIN": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2024-12-17T00:05:20.669Z",
        "rating": 5,
        "comment": "Great place to stay in the Palm Springs area. Nice place and very friendly host with proactive communication. Would stay again!",
        "privateFeedback": "Coffee bar is a nice touch. Your guide was very informative.",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "LOCATION": 4
        }
      },
      {
        "date": "2024-12-15T18:51:19.126Z",
        "rating": 5,
        "comment": "I had a great stay. It’s a quiet corner apt on a quiet street near Trader Joe’s and not too far driving anywhere. Thanks Eann",
        "privateFeedback": "Hi Eanne \n\nI liked your place but the Internet shuts off and reboots every 10 min which made it very hard to do business on zoom or Google Meet. \n\nWhen you walk in the bedroom there’s a noise that creaks and makes a rattling sound which is a little bothersome. \n\nOther than that it’s great! \n\n:))",
        "categoryRatings": {
          "VALUE": 5,
          "LOCATION": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2024-12-11T23:17:16.610Z",
        "rating": 5,
        "comment": "Superb place for our family!  Design and functionality is incredible!",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2024-12-09T23:09:02.717Z",
        "rating": 5,
        "comment": "We enjoyed our stay and the location. Awesome communication throughout, highly recommend!",
        "privateFeedback": "",
        "categoryRatings": {
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2024-12-02T18:01:20.592Z",
        "rating": 5,
        "comment": "absolutely loved our stay here and would stay again.",
        "privateFeedback": "",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2024-12-02T07:57:28.364Z",
        "rating": 5,
        "comment": "We had such a wonderful stay at Eann’s house! The kitchen is very well equipped, beds are comfy, and Eann was so responsive and has thought of so many details to make the stay comfortable and enjoyable.  We hope to be back again!",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2024-12-01T05:53:02.804Z",
        "rating": 0,
        "comment": "Eann은 최고의  게스트였습니다. 눈이 많이오는 날 한국에 도착했고 여행이 힘들지 않았나 걱정됩니다. 항상 나를 친절하게 대해주고 존중해줘서 고맙습니다. 숙소 청소를 아주 깔끔하게 해주셔서 감사합니다. 또오세요",
        "privateFeedback": "Wish you all the best!",
        "categoryRatings": {
          "RESPECT_HOUSE_RULES": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2024-11-30T22:03:41.267Z",
        "rating": 5,
        "comment": "Extremely responsive and friendly. The home had ALL the amenities you could think of and more! The home was very clean and organized. They thought of everything!",
        "privateFeedback": "My parents were in awe of how your home had everything that we needed (kitchen amenities, amenities for our baby). Everything was so well organized and decorated. Thank you again for letting us stay at your beautiful home!!",
        "categoryRatings": {
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2024-11-29T00:50:56.754Z",
        "rating": 5,
        "comment": "The host was great. She was very kind and always promptly responsive. Thank you, Eann. We want to come back someday.",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2024-11-28T00:53:19.932Z",
        "rating": 5,
        "comment": "Really awesome place. Good kitchen with everything you need, loads of spices and utensils were provided so we just had to buy food.\n\nThere were games which helped us entertain ourselves in the evening.\n\nAll in all a very comfortable stay.",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2024-11-23T16:28:45.523Z",
        "rating": 5,
        "comment": "The condo had a cozy & welcoming vibe. I prefer a condo to a hotel because I enjoy cooking. Eann's kitchen very well stocked with amazing pots and pans (I'm ordering a set of GreenPans for my kitchen) storage containers, utensils etc. Made cooking a real pleasure. I do recommend a new toaster. Just the right amount of decor. Very comfortable bed and pillows. Everything was extremely clean. The condo was a marvelous place to rest and plan our excursions into Palm Springs and to various hiking trails. Very obvious that Eann is focused on providing a 5 Star Experience for her guests. She reached out more than once to make certain that all was going well and that we were enjoying our stay. I've chosen many AirBnBs. This one is definitely in the top 3. Kudos to Eann for being an amazing host.",
        "privateFeedback": "I did mention the toaster does need to be replaced. No matter how low the setting, it chars half the bread and leaves the other half totally untoasted. I ended up using two of the gray dish towels for placemats. Your wonderful glass table needs placemats. Also it got a bit chilly in the evenings and so we turned up the heater to 70 degrees. Sort of smelled burning dust and so my husband believes that the furnace filter needs to be changed. \n\nReally an excellent experience and you've definitely given a lot of thought to making it as comfortable and pleasant as possible for your guests.\n\nTake Good Care and Happy Holidays.\nSharon",
        "categoryRatings": {
          "VALUE": 4,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 4,
          "ACCURACY": 5
        }
      },
      {
        "date": "2024-11-18T20:33:11.185Z",
        "rating": 5,
        "comment": "Really enjoyed staying at Eann's place as it was central to Palm Springs and Palm Desert.   The beds were very comfortable and all of the necessities was included.  Parking is a little of a walk and need her place has stairs but other than that it was a great place.",
        "privateFeedback": "Hi Eann, thanks again for letting us stay at your place, enjoyed it.   Check on the guest bathroom hot water had little flow and not hot water.",
        "categoryRatings": {
          "LOCATION": 4,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2024-11-16T03:29:11.828Z",
        "rating": 5,
        "comment": "Wonderful experience. Very clean and well decorated home, it had everything from putting green to fooseball and hot tub. Everything was as described and as seen in the photos. I have nothing but positive things to say about the place and the host. She was very responsive,  offered us early check in and responded to text messages immediately whenever we had questions. The transponder made it very easy to go in and out of the country club without having to wait in the security line and the garage opener made it easy to park inside. We had a great time visiting the Palm Springs area and highly recommend Eann’s home.",
        "privateFeedback": "Thank you for your hospitality!",
        "categoryRatings": {
          "LOCATION": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2024-11-09T05:40:16.005Z",
        "rating": 5,
        "comment": "Would recommend this space to anyone. Close to many things and only 10 minutes from Palm Springs. I loved it!",
        "privateFeedback": "",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "ACCURACY": 5,
          "CHECKIN": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2024-11-03T23:03:15.817Z",
        "rating": 5,
        "comment": "Good place to stay in Palm Springs",
        "privateFeedback": "Hi, the overhead master bedroom light turned on in the middle of the night.  Not ideal.",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2024-10-30T02:54:56.750Z",
        "rating": 5,
        "comment": "Beyond happy with Eann’s place! She was a super responsive host and had every amenity you could think of! It was extremely family friendly with all of the things you could need for a baby and kids! The layout was very functional. The space was clean. The kitchen was well stocked. It was close to lots of restaurants and shops. We would 100% stay here again!",
        "privateFeedback": "Thank you so much for being such an amazing host! We had a great time and really appreciated how quickly you replied!",
        "categoryRatings": {
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2024-10-26T21:45:56.815Z",
        "rating": 5,
        "comment": "This is a wonderful space and vacation rental!  The kitchen, bedrooms, bathrooms all are beautifully designed and decorated.  The home feels welcoming immediately.  The amenities are great and everything you could ever need.  Loved my stay here and highly recommend to anyone traveling to Palm Springs.",
        "privateFeedback": "I have already reported the items needing repair.  But loved everything",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2024-10-21T22:20:22.091Z",
        "rating": 5,
        "comment": "First and foremost, I highly recommend you book this property with Eann because the home is cozy, fun, and Eann was an excellent host! Eann was very helpful, friendly, and she communicated clear instructions and feedback. I appreciated how responsive and flexible she was. For example, I requested an early check in because we were traveling with a baby and a toddler and attempting to avoid traffic and the heat. Eann was flexible in letting us check in early for no additional charge. \n\nIn addition, my family had so much fun putting in the backyard. My toddler was obsessed with \"golf\" and we putted for hours over the course of our stay.  I really appreciated the attention to detail Eann had with the coffee bar, cookbooks, and local dining recommendations such as Heirloom Craft Kitchen. We ended up ordering a to go from Heirloom Craft Kitchen and it was absolutely delicious. \n\nOverall, this is a family friendly property and I highly recommend this property to everyone!",
        "privateFeedback": "Hi Eann, I have minimal suggestions because we were very pleased with everything! The only suggestion I think that would add value is to replace the sheets with cooler perhaps better quality cotton sheets. I found them to be fairly hot and not breathable at night at least in the primary room where I slept. It did keep me up a bit, but I understand that others may have different preferences. Nonetheless,  I suspect that given the heat and desert climate a cooler fabric would improve the comfort for most people.",
        "categoryRatings": {
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "LOCATION": 4,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2024-10-15T03:30:34.461Z",
        "rating": 5,
        "comment": "This place was decorated beautifully and very well stocked. The location was great for all of the different things we had planned to do. Very happy we booked Eann’s place! She was extremely accomodating !",
        "privateFeedback": "Thanks so much for allowing us to stay at your beautiful place for my girls’ birthday weekend!",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2024-09-29T21:06:47.099Z",
        "rating": 5,
        "comment": "Amazing home & host! I can’t wait to come back.",
        "privateFeedback": "",
        "categoryRatings": {
          "VALUE": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2024-09-15T04:15:02.610Z",
        "rating": 5,
        "comment": "Such an amazing space!! The bed was incredibly comfortable, with blackout blinds, and great AC, despite it being the hottest weekend of the year!\n\nThe kitchen was fully stocked and beautifully renovated. Eann was such a responsive host and had a welcome book with all the details we needed, including restaurant recommendations.\n\nThank you for hosting us, Eann - it was exactly what we needed and indeed a retreat!",
        "privateFeedback": "The best host :)",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2024-09-09T16:02:14.492Z",
        "rating": 5,
        "comment": "We loved our time at Eann’s home! It was so cute, clean, spotless - she thought of everything!\n\nThe location was perfect - we were looking quiet and relaxing, but still in Palm Springs. The Palm Springs surf club is 5 minutes away and we had a great time. We also spent a lot of time at the community pool right around the corner, and we were the only ones there that it felt like a private pool. \n\nThe bedrooms were huge (especially the primary), the bathrooms were so cute and clean, and overall you can tell Eann put a lot of thought into the design and furnishings. We had an amazing time and can’t wait to come back!",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "LOCATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2024-09-03T00:09:58.728Z",
        "rating": 5,
        "comment": "Eann’s home was a great place to stay for a family weekend! The home was very comfy, spacious, and beautifully decorated. If you’re planning a trip to Indio, I definitely recommend staying here. Be prepared that if you are going during summer time, Indio is extremely hot, however the home had AC that works amazingly and a pool nearby to cool down! Thanks for the lovely time!",
        "privateFeedback": "",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "VALUE": 4,
          "ACCURACY": 5
        }
      },
      {
        "date": "2024-08-24T01:54:16.812Z",
        "rating": 5,
        "comment": "Nous avons passé un excellent séjour chez Eann, où l’atmosphère est sereine et joyeuse à la fois. La maison est très confortable, joliment décorée, et rien n’y manque. Les amateurs de café sont particulièrement gâtés ! \nLa piscine et les installations sportives du domaine, ainsi que le jacuzzi privé, sont très appréciables. La communication avec Eann a été aussi cordiale qu’efficace. Nous recommandons vivement le Cozy Cactus si vous souhaitez découvrir le très beau désert de Joshua Tree.",
        "privateFeedback": "Merci beaucoup pour votre accueil et toutes vos attentions. Bravo pour l’atmosphère que vous avez su créer dans votre maison si chaleureuse !",
        "categoryRatings": {
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2024-07-21T22:10:35.489Z",
        "rating": 0,
        "comment": "Eann was a great guest with good communication and left our place neat. She is welcome back again!",
        "privateFeedback": "Glad you enjoyed your stay!",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "RESPECT_HOUSE_RULES": 5
        }
      },
      {
        "date": "2024-07-18T04:58:42.023Z",
        "rating": 5,
        "comment": "Eann is a gracious host! She is very responsive and helpful. Her home is every bit as wonderful as it looks in the photos. It is beautiful, very well-appointed, incredibly clean, spacious, and comfortable. The beds were very comfortable. We loved the kitchen! Eann has thought of every detail. We loved having a garage w/ a remote opener. Her home is very family friendly and comfortable. The air conditioning is GREAT, which was a necessity with 113 degree temps. Check-in and check-out were a breeze. We couldn't have asked for more! Thanks, Eann!",
        "privateFeedback": "Thanks, Eann! Everything was perfect! We loved staying at your home and appreciated all of your attention to detail. The only recommendation we would offer is considering black-out curtains in the bedrooms. I don't know if you have other guests keeping crazy hours like we do, but it was a bit difficult to sleep in with the bright, sunny days in Indio. Not bad, and we're not complaining. It's just a thought. I've stayed in many Air BNB's and your is one of the very best! I LOVED the comfy master bed with the huge pillows. :) Thank you so much. We hope to return. :)",
        "categoryRatings": {
          "LOCATION": 4,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2024-07-08T01:49:47.445Z",
        "rating": 5,
        "comment": "My family and I drove into CA from Michigan.  Eann's place was just what we needed after a 36hour drive. It was clean, beautiful and welcoming. Eann was an amazing host and accommodated my local family coming and going. She responded quickly. 10 out if 10 recommend as my kids would say!",
        "privateFeedback": "Thank you so much for accommodating my family. It was perfect and I wish we had more time to stay longer. \n\nBridgette",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2024-06-30T20:06:19.318Z",
        "rating": 5,
        "comment": "My team stayed at this nice airbnb during an installation in Indio and it was very convenient. Great hosting by Eann and the property had everything you could ever need during a stay. My company Space Launch, sets up rentals and we can tell that she did a great job designing and making sure she has all audiences covered for an enjoyable stay.",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "ACCURACY": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2024-06-17T00:23:04.384Z",
        "rating": 5,
        "comment": "We rented this home for a girls trip and it was perfect! Eann was super responsive and helpful! Could not have asked for a better place to spend time with close friends or family. It is close to restaurants and shopping too! Eann thinks of everything you could possibly need and has it thoughtfully arranged throughout the house. 10/10 recommend!",
        "privateFeedback": "Everything was so thoughtfully arranged throughout the house! We loved how the kitchen was labeled! Thank you for providing a home that was perfect for our girls weekend!",
        "categoryRatings": {
          "VALUE": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2024-06-09T21:18:29.127Z",
        "rating": 5,
        "comment": "The place was perfect for our family. Kid friendly home. Felt very comfortable. It definitely went beyond our expectations!",
        "privateFeedback": "Thank you so much. We felt right at home. We will definitely be coming back",
        "categoryRatings": {
          "CHECKIN": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2024-05-28T00:18:14.479Z",
        "rating": 5,
        "comment": "Even before we checked in, our host was very friendly, communicative, and answered all our questions. The accommodations were perfect for our Girls Trip, with plenty of space for relaxing and card games. The place was clean, wonderfully decorated, and included all the amenities we could need. Thank you so much for hosting us in your beautiful home!",
        "privateFeedback": "Eann, thank you so much for hosting us. We had such a fun girls weekend thanks to your accommodations. Hopefully our review will brighten your day!\n\nThere were just a couple things I wanted to bring to your attention:\n\nThere is an electrical outlet in the queen bedroom next to the door that has a broken outlet face. We didn’t have any issues with it but it might be a safety hazard.\n\nThe dishwasher leaks a little bit of water from the bottom right corner when running. Again, it wasn’t a major issue - we just set a rag there when we ran it - but just wanted you to be aware.\n\nThank you again and if we ever find ourselves needing a place to stay in Indio again, we’ll be sure to look you up!",
        "categoryRatings": {
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "LOCATION": 4,
          "CHECKIN": 4,
          "COMMUNICATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2024-05-22T19:26:10.910Z",
        "rating": 5,
        "comment": "This place is great! Super comfy and clean. I would stay there again.",
        "privateFeedback": "The only thing I would change would be the coffee creamers since I think they were expired; once I poured them into the coffee it was chunky. The other thing was that the advertisement stated there was baby shampoo and we could not find it to bathe our babies. But those are just minor things. Everything else was awesome.",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2024-05-18T01:10:57.440Z",
        "rating": 5,
        "comment": "Absolutely outstanding experience and lovely space! We had a wonderful and relaxing few days and everything was top notch. The attention to detail was incredible, and Eann thought of everything. We will definitely be back for our next trip!",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2024-05-07T18:28:07.896Z",
        "rating": 5,
        "comment": "Eann was an incredible host with top notch communication. The house is cozy, clean and fully stocked. Would absolutely recommend and stay again!",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2024-04-30T00:26:55.129Z",
        "rating": 5,
        "comment": "The house was great and really convenient for Stagecoach.  Eann was very responsive and helpful before and during our trip",
        "privateFeedback": "",
        "categoryRatings": {
          "VALUE": 5,
          "CHECKIN": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2024-04-15T23:05:00.208Z",
        "rating": 5,
        "comment": "Eann is truly the most incredible host! Every detail of the house was so thoughtfully done. We couldn’t imagine a better location to enjoy Coachella. The house is within walking distance of the festival - in a safe and quiet neighborhood. Eann provided us with so many helpful instructions in a cute little ‘Festival Guide’ which made our experience seamless. The house is beautiful, spotlessly clean, spacious and comfortable. It is also filled with SO many amenities. Eann is friendly, communicative, and responded to any questions we had immediately. You won’t regret booking this spot! An absolute Coachella dream!!",
        "privateFeedback": "Hi Eann!\n\nThank you so much again for a wonderful stay! It’s so apparent how much care and passion you put into The Cozy Cactus. It is definitely the best Airbnb I have ever stayed in. \n\nI appreciate how responsive you were regarding the construction workers. \n\nWe were trying so hard to be respectful to the house rules: I made my husband and Hitomi sit in the car for 10 minutes until it was exactly 4:00pm. When Molly + Scott got in at midnight, we whispered as we helped them with their bags and I forbade them from going on the porch. We felt we were truly Coachella ‘dream guests’.\n\nWhen  I got your message Friday (after driving 3 hours and not really thinking straight) I didn’t expect the solar panel would be a big deal. So I felt a bit let down - paying almost $10k - to have such a disruption. That level of noise for hours is unacceptable at any price, but especially paying that premium.. \n\nI understand these things happen and I would still definitely recommend and book again. ❤️",
        "categoryRatings": {
          "CHECKIN": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2024-04-12T16:41:23.763Z",
        "rating": 5,
        "comment": "Beautiful place! Definitely recommend staying here.  Very comfy beds and there’s lots of space.  The hot tub and golf adds a nice touch.",
        "privateFeedback": "Hi there,\n\nThanks so much for letting us stay.  Just a small note and not a big deal but it would be nice to have blackout curtains in room.  It’s always nice when on vacation for some to have the room dark to sleep in :)",
        "categoryRatings": {
          "CHECKIN": 5,
          "VALUE": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2024-04-11T03:11:49.587Z",
        "rating": 5,
        "comment": "Gros coup de cœur pour cette maison, nous recommandons les yeux fermés! Nous avons passé une semaine magnifique dans cette maison avec nos 3 enfants, sans aucun doute le meilleur airbnb que nous ayons eu. La maison est encore mieux que sur les photos, très confortable et spacieuse. On y trouve tout ce dont nous avons besoin pour passer un séjour sans aucun manque. Située dans un joli environment calme, c’est la premières fois que nous nous sommes véritablement reposés pendant nos vacances avec nos 3 enfants ! La piscine à quelques mètres de la maison était un vrai plus aussi, parfaite pour les familles. Encore merci pour ce séjour, nous sommes rentrés totalement ressourcés !",
        "privateFeedback": "L’eau du jacuzzi peut être un peut trop chlorée ? Nous n’avons pas pu continuer à l’utiliser à partir du vendredi car nous avions la peau irritée avec des démangeaisons.",
        "categoryRatings": {
          "CHECKIN": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2024-04-03T21:50:01.822Z",
        "rating": 5,
        "comment": "We spent the month of March at Eann's place. The location was great, Eann went above and beyond when we had an issue or question.  Our stay was seamless and we'd consider staying here again. Thanks Eann.",
        "privateFeedback": "Eann the only thing I can say is your place could have been a bit cleaner.  The Kitchen runner was very dirty but once we washed it we felt better.  Once we washed the floors with the swiffer and did some dusting we felt more at home.  Also the couch is really warped in the middle and not very comfortable.  Your TV was amazing once Jim could figure it out.  I don't know maybe just a Canadian thing? lol. We were not used to streaming TV  so it took a while to figure out all you can do with it.  Over all we really enjoyed our stay and found you to be delightful.  Thanks again for hosting us.  Maybe, if we can, we we'll be back next year.  \n\nAnn Thomas",
        "categoryRatings": {
          "LOCATION": 5,
          "CLEANLINESS": 4,
          "ACCURACY": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2024-04-03T01:00:07.705Z",
        "rating": 5,
        "comment": "Amazing stay that exceeded expectations. The house was perfect for a family of 4, had all the amenities and easy to walk to the pool, tennis, pickleball courts and fitness center.",
        "privateFeedback": "Thanks for everything! You were amazing and we will be back for sure!",
        "categoryRatings": {
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2024-03-30T05:03:17.411Z",
        "rating": 5,
        "comment": "This was a great place to stay! My all girl squad and myself had an amazing time in this beautiful location. Eann was a great host and the house met all our expectations. \nWould definitely recommend!",
        "privateFeedback": "Thank you so much for making my bachelorette all girls getaway so beautiful and special! Will definitely be back soon with the whole family.",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2024-03-11T19:22:08.159Z",
        "rating": 5,
        "comment": "It was a wonderful place, great communication and location.",
        "privateFeedback": "",
        "categoryRatings": {
          "VALUE": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2024-02-17T12:58:45.823Z",
        "rating": 5,
        "comment": "We had a great stay at Eann's place. The place was spacious, clean, and beautifully decorated. We travelled with our 1.5 year old and really appreciated all the amenities (pack and play, high chair, change pad, kids books & toys) to help make our stay with our toddler feel relaxing. Loved the hot tub, having coffee every morning in the backyard, and the very comfortable main (green) bed. Appreciated all the little extras at this location including travel coffee cups, Tupperware storage for food, nice beach towels for the hot tub/pool, etc. \n\nWe received weather flood alerts during our stay and Eann was very responsive in giving us advice on how to navigate all of this. Overall, a wonderful stay - we'd highly recommend this location. Felt very safe, cozy, and the community pool was warm and nice to use even during the cool weather!",
        "privateFeedback": "Thanks Eann! We had a great time staying at your place! \n\nA couple of minor things to let you know about:\n- the smoke detector went off the one time we went to use your oven. I'm not sure if it just does that sometimes or if maybe the oven needed cleaning. Just a heads up!\n- there is a transition board on the floor between the flooring in the main bedroom (where the green bed is) and the bathroom ensuite, and that board is loose/fell off. It likely just needs to be glued back down. Not sure if anyone told you about that yet!",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2024-01-29T02:40:58.094Z",
        "rating": 5,
        "comment": "beautiful. clean. perfect for our multi-generational family of five. kids loved the mini golf, foosball, and nearby pool. adults appreciated the cheerful, gorgeous decor and warm touches throughout the home making things like wifi sign in and morning coffee effortless. host communication was quick, clear, and helpful! we can't wait to stay here again.",
        "privateFeedback": "Hi, Eann. \n\nthanks for hosting us. your home made us feel so welcome. we loved the little mindfulness notebooks and signage and the gorgeous colors and textures throughout. this has become one of our favorite airbnb stays to date!\n\n-kim",
        "categoryRatings": {
          "CHECKIN": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2024-01-23T01:25:27.209Z",
        "rating": 5,
        "comment": "This was the most well stocked and very well done Airbnb we have ever been in… it set the bar super high for our 2024 travels. Everything you could want in a kitchen, so many details around the house, comfy beds, fun backyard… we would stay here every time we come to the area!",
        "privateFeedback": "We absolutely loved your home… we cooked every night so it was o nice to have such a well stocked and well thought out kitchen! Thank you so much!",
        "categoryRatings": {
          "LOCATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2024-01-20T23:23:05.045Z",
        "rating": 5,
        "comment": "With so many options in the desert, I'm so glad I chose this place for decor, location, accommodations, the community pool, and amenities. Seriously, Eann has thought of everything! She was the most responsive, pleasant host I've ever had at an Airbnb. I ran out of time before getting to explore all of Palm Springs. There were beautiful views and it was easy enough access to downtown,  \n\nEann is such a friendly and proactive host - she thinks of everything. Next time I am in Palm Springs for work, I will be sure to stay longer, especially with her unique and clever wall desk setup, great wifi, and well stocked kitchen.\n\nCountless thoughtful touches make Eann's condo an excellent choice for digital nomads, couples, or anyone wanting a peaceful desert getaway. 10/10 recommend. Thanks so much for a great stay, can't wait to come back!",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-12-29T20:59:34.348Z",
        "rating": 5,
        "comment": "The house was exactly as described. It was a great place for our holiday. Eann made it seem less.",
        "privateFeedback": "Thanks Eann, some spa jets didn’t seem to work too well and the corn hole was all warped and I thought there was going to be a going Jenga? Anyway, we had a great time! Cheers Sheila",
        "categoryRatings": {
          "LOCATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-12-18T00:41:13.764Z",
        "rating": 5,
        "comment": "Honestly this one probably the best Airbnb I’ve ever stayed in! And I’ve been staying at Airbnb’s for 10 years. This is the first time seeing the place in person was better than the pictures.\nThe place was very clean, spacious and comfortable. Everything was easy to find and every room from the bathroom, to the kitchen and even the laundry room were well stocked. I have zero complaints and would definitely come back!",
        "privateFeedback": "Thanks again for having us! Just wanted to let you know one of the door cabinets under the island was loose. We found it that way so not sure if it was brought to your attention yet but I wanted to make you aware.\n\nAlso the single bed in the room with the bunk beds was kinda squeaky. Every time I moved the bed frame made a squeaking noise. \n\nOther than that everything was amazing! We really enjoyed our stay and my mom especially appreciated how everything was labeled. She wanted me to let you know she loved that! haha",
        "categoryRatings": {
          "ACCURACY": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-12-05T00:02:26.629Z",
        "rating": 5,
        "comment": "This place was perfect for our week stay. Plenty of room for 3 adults and a child. The backyard was fun and quiet, perfect for a morning cup of coffee. \n\nWe found everything we could possibly need and more. It was easy to get to Palm Springs for work and into Joshua Tree for some sight seeing. Don’t hesitate to book this home.",
        "privateFeedback": "Thank you for a wonderful stay! Can’t wait to be back soon!!",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2023-11-26T23:40:58.081Z",
        "rating": 5,
        "comment": "We had a wonderful experience at Eann’s. She was incredibly responsive. The house was beautiful and clean. The house was well stocked and a fun place to stay!\n\nI highly recommend staying in their beautiful home.",
        "privateFeedback": "",
        "categoryRatings": {
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2023-11-26T23:21:30.380Z",
        "rating": 5,
        "comment": "Eanns place was great! It was well stocked especially in regards to the kitchen and kids items. Eann was so easy to communicate with and quick to respond to our questions. The outdoor space was nice and pool is just across the street. Lots of cute touches to make the stay special. Would definitely come back!",
        "privateFeedback": "Thank you for a lovely weekend, Eann!",
        "categoryRatings": {
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "LOCATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-11-13T18:13:46.357Z",
        "rating": 5,
        "comment": "The Cozy Cactus is in a peaceful gated community and was the perfect spot for our family to recharge after spending the day in Joshua Tree. The house was well-stocked with necessities, and had clear instructions on how to access & use all the amenities. We particularly loved being so close to the community pool, and the kids enjoyed the backyard putting green.",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-11-02T03:08:22.615Z",
        "rating": 5,
        "comment": "Great host. Great location. Perfect for our family.",
        "privateFeedback": "",
        "categoryRatings": {
          "ACCURACY": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2023-09-22T23:54:47.198Z",
        "rating": 5,
        "comment": "Eann’s condo is everything an AirBNB should be! Her space is a model of what any renter would hopeful for (short or long term!). I hope to be back someday!",
        "privateFeedback": "You are awesome! Thanks for such a great stay. 💕",
        "categoryRatings": {
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2023-09-15T20:54:47.945Z",
        "rating": 5,
        "comment": "Had such a fun stay and would definitely go back!",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-09-14T19:08:04.516Z",
        "rating": 5,
        "comment": "Eann was amazing! She was so welcoming and nice. The house looked amazing. My friends and I still rave about the hot tub. That was our favorite part!",
        "privateFeedback": "Thank you so much for being such a sweet and welcoming host. If every host is like you, I would use Airbnb more often!",
        "categoryRatings": {
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-08-27T21:53:04.830Z",
        "rating": 5,
        "comment": "Absolutely loved my stay at Eann’s condo in Palm Springs! The location was unbeatable, with stunning views and easy access to local attractions. The amenities provided were top-notch, from the well-equipped kitchen (Keurig, French press, coffee pot) to the relaxing pool area (just on the other side of the building - heated too!). What truly made the experience exceptional was the host, who went above and beyond to ensure my comfort and enjoyment throughout my stay. A perfect getaway – I can't wait to return!",
        "privateFeedback": "Thank you!  Everything were great!",
        "categoryRatings": {
          "LOCATION": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-08-22T16:53:24.439Z",
        "rating": 5,
        "comment": "Eann's place was perfect for my family and me. Her home was exactly as pictured,  super clean and   had everything we needed from  kitchen utensils  pots and pans to an assortment of board games that we were able to use during Hurricane Hilary. Eann is an exceptional host very responsive and friendly, she checked on us during the storm and made us feel very comfortable. We felt like we were home the entire time. This was our first time in Palm Springs but will definitely return to  Eanns Cozy Cactus.",
        "privateFeedback": "Thank you again! We really felt at home the entire time",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2023-08-15T00:29:53.346Z",
        "rating": 5,
        "comment": "The perfect stay and the perfect host. A very well deserved 5 star rating!",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-08-11T03:05:35.741Z",
        "rating": 5,
        "comment": "Eann’s condo's is AMAZING! One of the best Airbnb’s I’ve ever stayed at. It’s dream for anyone looking to explore downtown Palm Springs - close enough to all the action, while having a clean, comfortable place to return to at the end of the day. Eann goes above and beyond by offering a starter set of essentials, ensuring that you have everything you need right from the start.\nI was blown away by the beautiful design and thoughtful touches that made this place feel like a true home away from home (record player, murals, renovated bathroom with gold accents and Further brand shampoo, conditioner, and soap, books, Roomba, etc). The brand new washer/dryer was an unexpected bonus, especially since most other rentals don’t have one, plus great AC in the desert heat, woof.\nThe attention to the detail, the luxurious amenities and convenient location make this condo a sure steal. If you visit Palm Springs, definitely consider to choose this condo as your stay. Thank you again, Eann!",
        "privateFeedback": "",
        "categoryRatings": {
          "VALUE": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-08-11T02:16:19.569Z",
        "rating": 0,
        "comment": "Absolutely wonderful guest! Took care of our home like it was her own. Not only did Eann communicate well, she left it in the best condition.  Thank you for staying with us!",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "RESPECT_HOUSE_RULES": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-08-09T17:05:00.694Z",
        "rating": 4,
        "comment": "We came across Eann’s place as we were searching for a kid-friendly and clean place on Airbnb and decided to book with her. Eann is a very nice, friendly and responsive host. The check-in is fairly easy and her welcome guide book is clear and very detailed. Upon check in, we noticed that one of the carbon monoxide alarm was left opened with no battery inside and the lights over dining room were out. We contacted her and she had them fixed the next day. However, the floor on the day we checked in feels a bit sticky. There was also a dirty cleaning rack left at the property. We were only in town for 2 nights and just wished that the experience would have been better.",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "VALUE": 4,
          "CLEANLINESS": 3,
          "CHECKIN": 5
        }
      },
      {
        "date": "2023-07-31T01:51:41.369Z",
        "rating": 5,
        "comment": "My family recently stayed at Eann's place and had a wonderful experience during our weekend trip to Indio. The home is immaculate and well-designed. We can tell there was a considerable amount of detail given to the presentation and cleanliness of the home. Eann was also very responsive and made sure to check in regularly via the Airbnb app to ensure we were having a great experience. My family also enjoyed the private hot tub in the backyard and the community pool that was practically next to the home. I would definitely come back again in the future. I highly recommend it!",
        "privateFeedback": "Thank you, Eann. We love the design of the interior and the home in general. Great job overall on this Airbnb! We hope we can stay again in the future.",
        "categoryRatings": {
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "LOCATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-07-26T16:18:06.080Z",
        "rating": 5,
        "comment": "Eann’s place was wonderful! As soon as we got there, we couldn’t stop raving about how mindful our hosts were about everything. They have everything you can think of. The home itself is huge and is beautifully decorated. Everything was clean, organized, and stocked for any extra guests as well. Eann was quick and responsive to any of our questions and needs. I highly recommend staying here. I can’t wait to visit again!",
        "privateFeedback": "Your place was awesome. We were so astonished with how detail-oriented the place was. I mean you guys had EVERYTHING. And that’s what makes great hosts! We felt right at home and we had a lovely time. Thank you.",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2023-07-18T18:08:58.425Z",
        "rating": 5,
        "comment": "We LOVED the decor, cleanliness, close access to the pool and golf course!",
        "privateFeedback": "Everything was great! Thank you for hosting us.",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2023-07-17T02:42:18.322Z",
        "rating": 5,
        "comment": "Our stay at this wonderful home in Indio, California was absolutely delightful. The house was very spacious and immaculately clean. It was beautifully furnished and decorated in a charming manner. The owner provided us with everything we could desire. The location was very pleasant and quiet.",
        "privateFeedback": "",
        "categoryRatings": {
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2023-07-09T23:27:47.542Z",
        "rating": 5,
        "comment": "I loved staying at Eann’s place and understand first hand why she has a 5 Star Super host rating. From the moment I booked my stay until I checked out, Eann was always proactive, friendly, and responsive. Her home was set up in such a way that it made me feel like I was in my own personal vacation home and as a parent I really appreciated the thoughtful touches that made it easy to keep my one year old entertained (such as games, play pen, Disney +, high chair, etc). \n\nWhat stood out to me the most (aside from the decor), was how clean the home was, and how clearly everything was labeled (I’ve stayed in other homes where things were cluttered and hard to find). \n\nI will definitely return to stay at the “Cozy Cactus” again!",
        "privateFeedback": "Thank you again for your hospitality. Enjoy the rest of your day!",
        "categoryRatings": {
          "ACCURACY": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2023-07-04T00:41:32.698Z",
        "rating": 5,
        "comment": "We had a great stay at the Cozy Cactus!\nThe house is very comfortable, very well decorated, well lit, just like the pictures! We felt right at home! \nWe loved the pool just across the street!\nThe back patio was very cute, fun place to hang out (even though it was starting to get very hot in Indio during our stay at the beginning of July).\nThe gated community is very nice, lots of walking trails alongside the golf course. We also used the lifestyle center to go play pickle ball one morning and had a great time with some of the permanent residents there. \nEann is a very responsive host. We would definitely rent from her again! Overall a great vacation!",
        "privateFeedback": "Thank you for a great stay Eann!\nThe cozy cactus was indeed very cozy, we felt right at home! Everything is decorated so cute, no clutter, it just felt so nice!\nWe appreciated your responsiveness.\nJust a few suggestions:\nFor a whole week we would have loved a couple more dish towels (we just had one) and a couple rags (to wipe counters (there was a sponge for dishes). A griddle would be a great addition to the kitchen.\nAnd as I already mentioned to you, maybe not having ground crew on the back patio at 6:45 am:)\nWe really enjoyed our stay and were happy to give you a great review!",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2023-06-27T17:37:29.491Z",
        "rating": 5,
        "comment": "By far the best Airbnb I’ve stayed at! The host was always responsive in quickly manner, and showed the uttermost kindness. Every detail and thought made our stay feel as if we were at home. There’s nothing I would change about our stay, it was perfect!",
        "privateFeedback": "Thank you, we’d love to stay with you again in the future! :)",
        "categoryRatings": {
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2023-06-18T23:03:27.775Z",
        "rating": 5,
        "comment": "We have been staying at Airbnb for almost 10 years and this is the first place that the host labeled everything, from switches on the wall to all drawers to scything single remote control. It’s soooo helpful.  This is inside a gated community with security guard at the entrance 24/7 to verify every visitor has a reason to go inside. We feel really safe. \nThe place is super clean and plenty of space for 6 of us to stay comfortably. The kitchen is well equipped and the coffee maker is very nice touch: you can start your day by grinding some coffee beans to make your own coffee. We also enjoyed the jacuzzi  very much. After a long day, soaking in jacuzzi feels really great. The host Eann is very responsive and proactive. We will definitely try to rebook this place in the future if we visit this area again.",
        "privateFeedback": "Thank you for being a great host. We don’t have anything to complain about. :)",
        "categoryRatings": {
          "CHECKIN": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2023-06-12T20:26:14.229Z",
        "rating": 5,
        "comment": "Eann was amazing - SUPER responsive! The house was beautiful. The beds were all quite large, and the rooms were spacious. So cutely decorated, definitely a 10/10 stay - I will be coming back to this house for any future stays in the area!",
        "privateFeedback": "Thank you Eann for such a great stay!",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "CHECKIN": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2023-05-30T00:27:26.938Z",
        "rating": 5,
        "comment": "The place was immaculate. We have an electric car so was ableto charge our car. The kitchen, the utensil and all the electrical hardware was spotless. The coffee machine, percolator, toaster, the bbq etc were all great. Instructions in the house was also very clear. Anything that you wished for was provided like coffees, organic tea, many many herbs, olive oil you name was there. The TV in every room had all the channels like Netflix, Apple TV and many more working. The foosball table was also great to have. I personally even glued the\nalready lifting (it was like that when we got there) side border. \nIn short the hosts were amazing with the way the house was prepared. We all want to thank her from here and they should go on train other house owners. We are frequent users of Airbnb and have never had house so well prepared. \nThank you......",
        "privateFeedback": "Eann thank you very much for the amazing house and the way it was prepared. We tried to clean it as much as we can before we left and hopefully it will make your life easier when preparing for the next guests. If you ever get to Santa Monica give us a call and come and have some cake and tea or coffee with us. My number 3104306552.\n\n\nThank you again from all of us that stayed there.",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2023-05-28T14:08:39.737Z",
        "rating": 5,
        "comment": "Very nice place! very responsive at any time with any questions.",
        "privateFeedback": "Thank you",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2023-05-22T14:29:30.977Z",
        "rating": 5,
        "comment": "Eann was a wonderful host and we enjoyed our time here very much. We loved it so much that, after our initial 3 days, we decided to extend our trip! Eann was very responsive and made adding in extra time so easy! \n\nThe house is as pictured and the decor is lovely. Eann has so much information on hand and made check in, pool access, and any other questions we had super easy.\n\nWhat made the stay really next level though we're all the added amenities. From the coffee bar to board games to pool floaties and towels, she had everything we could need to enjoy our stay. We also picked this place because we were traveling with a baby and toddler and they had everything we needed! Crib, high chair, changing table, extra toiletries. They had it all. I would recommend this place again and again and we will probably try to come back at the same time next year!",
        "privateFeedback": "Thank you so much for hosting me and my family!",
        "categoryRatings": {
          "LOCATION": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-05-15T02:08:08.190Z",
        "rating": 5,
        "comment": "Eann’s place was fantastic. She had everything we needed and the house was bright, clean and sooo comfortable. Eann was quick to respond and helpful when I had visitors who needed to get in the gate. We will definitely stay there again!",
        "privateFeedback": "Thanks so much for getting all of in the gate at all those different times. You made it so stress free for me. Loved your house. Sorry about the dishes in the sink. We ran out of time!",
        "categoryRatings": {
          "LOCATION": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-05-09T01:45:50.808Z",
        "rating": 5,
        "comment": "Eann’s place is great and stocked with everything you could need! We had such a fun and relaxing weekend.",
        "privateFeedback": "Thanks so much!!",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2023-05-01T20:37:55.741Z",
        "rating": 5,
        "comment": "This house was amazing! All of the beds were super comfy. We went for Stagecoach weekend and all of the neighbors were so friendly giving rides on their golf cart. The kitchen and rooms were all amazing, her pictures and descriptions match perfectly. From the main gate on Monroe, it was about a 15 minute walk to the yellow brick road for the polo fields entrance. Awesome place to stay for Coachella/Stagecoach weekends. There’s also a cute community pool. 100% stay here!!",
        "privateFeedback": "Everything was awesome! Thank you so much for everything - the book you have with directions is perfect and was easy clean up at the end.",
        "categoryRatings": {
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2023-04-13T21:40:16.583Z",
        "rating": 5,
        "comment": "Super clean, and cute. Had a wonderful pre-Coachella stay and would totally recommend others to stay here!",
        "privateFeedback": "",
        "categoryRatings": {
          "VALUE": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-04-13T14:35:04.376Z",
        "rating": 5,
        "comment": "What a beautiful guest house! This was a perfect place for our family vacation. The decor was so charming and inviting. The kitchen was thoughtfully stocked with everything we needed to enjoy home cooked meals. The house was clean and comfortable and we very much enjoyed the amenities of a pool and hot tub. Our children noticed all the touches that made them feel right at home. The neighborhood was lovely to walk through and neighbors were friendly. Close to stores and only 30 mins from Joshua tree. Eann was very responsive when we had questions and truly cared about our experience.",
        "privateFeedback": "Thank you so much for sharing your guest home with us. It was so lovely. We also very much appreciate your responsiveness when we had questions and for letting us stay an extra hour. The kids got a little extra time in the pool and we didn’t have to wait at the airport for an extended period of time. \n\nI did wand to mentioned that we had a hard tome using the grill. We couldn’t get it to stay up to temp when opening and closing to flip food and we had to look up Insteon refilling with pellets. It is quite possible that this was a user error on our part but may be good to have some instructions on there. \n\nOther than that, all was well and we hope to rerun again someday.",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2023-04-04T01:36:23.434Z",
        "rating": 5,
        "comment": "The community the home is in is quiet and family friendly. Pictures are very accurate. Would definitely stay again",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2023-03-31T16:39:26.537Z",
        "rating": 5,
        "comment": "Enjoyed our 1st time in Palm Springs and Eann's home made it even better. We all (family of 4) had our own space to sleep & relax and we were able to to enjoy the comfort of the hot tub after our long days of hiking or shopping. We loved our morning walks around the community and we found it easy to come and go through the security gate. Eann's home was sparkling clean and we loved the style.",
        "privateFeedback": "Thanks for being responsive & quick to answer questions. Sorry that I didn't realize the link  for the welcome book& the book in the house were different until a few days into our trip. I appreciated your help when finding a another pool to go too since the closest one was under construction. I hope we were able to help the cleaning crew out a little after you gave us an extra hour for check out. We all loved the home and I think my husband said 3 different times, \"This is the nicest place we have ever stayed.\" Our kids (13 & 16) loved ending our day in the hot tub and are now convinced we need one! Thanks for giving us a fun & comfortable spring break family vacation! -Tiffany",
        "categoryRatings": {
          "LOCATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-03-31T11:00:02.196Z",
        "rating": 0,
        "comment": "Eann was a great guest! We would welcome them back anytime. Safe travels :)",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "RESPECT_HOUSE_RULES": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-03-21T19:31:57.110Z",
        "rating": 5,
        "comment": "Great place to stay in the desert! Updated, super clean, and with lots of space. Eann was super friendly and attentive. I definitely recommend this place.",
        "privateFeedback": "Thank you so much! The coffee bar was great!",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-03-19T17:36:28.297Z",
        "rating": 5,
        "comment": "We had an excellent stay! Eann was the best Airbnb host we’ve ever encountered- everything about the stay was curated to go above and beyond all guest needs and she was extremely responsive and helpful! We were traveling with a 3 month old and all the baby items were AMAZING and thoughtful- such a family friendly home. 11/10 would recommend this home and will be back again!",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2023-03-14T19:11:21.289Z",
        "rating": 5,
        "comment": "Eann's place is by far the most beautiful, well stocked, comfortable and cleanest Air B&B we've every stayed in.  Our family of five (kids ages 13,, 10, 4) enjoyed the our time there and it was even warm enough to use the pool right next door on one of the days we visited.  The neighborhood is quiet and everyone was very friendly.  We felt comfortable and safe leaving our kids so we could do walks and runs around the neighborhood.  The hot tub was immaculate as was everything really and the beds were very plush and comfy!  We'd highly recommend and will definitely book the Cozy Cactus again in the future!",
        "privateFeedback": "On the night we arrived, the line to enter the neighborhood was massive so we went to dinner and came back - so not a big deal at all.  We learned that there was a tennis thing happening in the area so that might have attributed to the extra traffic?  A heads-up would have been nice but totally understand that this isn't always possible as you can't possibly know everything going on :).",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2023-03-08T18:53:34.747Z",
        "rating": 5,
        "comment": "Wow, the place and hosts are fantastic! All the extra touches really add to a great vacation. Our family rents a lot of houses for our getaways and this place is top of our list now.  It’s quiet and spacious and a great hang out. We didn’t want to leave and will definitely be back. Thank you Eann!",
        "privateFeedback": "We loved your place and can’t wait to come back! Thanks for making it such an awesome getaway!",
        "categoryRatings": {
          "CHECKIN": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2023-03-07T02:53:40.152Z",
        "rating": 5,
        "comment": "What an amazing AirBnB! The description was totally accurate and Eann was super responsive. All the kids stuff at the AirBnB was super helpful. Really enjoyed the place!",
        "privateFeedback": "Thanks for a great place and being responsive!",
        "categoryRatings": {
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2023-02-27T17:49:12.916Z",
        "rating": 5,
        "comment": "Eann was a great host with excellent communication. The house was perfect and very clean!",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-02-19T04:58:06.032Z",
        "rating": 5,
        "comment": "My family had an excellent stay at Eann’s house. There was more than enough space for me and my wife, two boys and a grandpa. The house has a private back yard in a quiet neighborhood, and inside is clean and welcoming, with a huge kitchen and a bunch of ways to make coffee! Eann provides amenities for young kids, plus games and a foosball table, pool toys and even pickle ball racquets that we tried out. The boys also loved the bunk beds!\n\nWe spent a ten day vacation driving around the area to restaurants, hiking in Murray Canyon and Joshua Tree Park, and visiting the zoo in Palm Desert. But we spent plenty of time relaxing in the house hot tub and swimming with our boys in the nearby pools.\n\nEann was incredibly responsive, answering questions and making sure we had what we needed. This is a great place to unplug with your family, make some memories and relax.",
        "privateFeedback": "Everything was great and we really thank you.\n\nA simple suggestion would be some tissue boxes in the bathrooms and some more hand towels. \n\nI appreciate how quickly you always responded, and you’ve made a great place to have a vacation.",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5,
          "VALUE": 4,
          "LOCATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-02-08T00:41:42.767Z",
        "rating": 5,
        "comment": "The “cozy cactus” was a great place for us to have as a home base to spend a few days in Palm Springs (Indio) … Eann has put so much care into looking after “anything” you could wish for in an Airbnb … fabulously well stocked, and beautifully decorated. Private little covered patio is so nice to spend a morning in the early sun with a gourmet coffee from her new little coffee & tea bar - such a nice welcoming touch. Very comfortable & quiet place for our family, when in Palm Springs - Great host ! - Thanks for sharing your little oasis with us - would “highly”recommend!!",
        "privateFeedback": "We had such an amazing time at your place, and would love to come back!!💕",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "LOCATION": 4,
          "CHECKIN": 5
        }
      },
      {
        "date": "2023-02-07T17:00:23.864Z",
        "rating": 5,
        "comment": "Very responsible and caring host. She helped my coworkers check in as much as she could!",
        "privateFeedback": "Thanks for everything!",
        "categoryRatings": {
          "LOCATION": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 4,
          "VALUE": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-02-01T18:29:33.166Z",
        "rating": 5,
        "comment": "Everything about this AirBnB was amazing.  The styling of the house was spot on, truly beyond beautiful.  The kitchen had everything you needed, the house was spotless and the area was quiet.  We had very comfortable beds to sleep on and the host even provided pool towels!  I think my favorite part was simply how communicative Eann (the host) was.  She checked in on us and helped us every step of the way.  We could not have asked for a more perfect experience!  Definitely going to be coming back again if we are in the area!",
        "privateFeedback": "Eann, you are amazing through and through!  Thank you for being the best host I have ever had!",
        "categoryRatings": {
          "VALUE": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "LOCATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2023-01-23T05:46:49.882Z",
        "rating": 5,
        "comment": "I’m not one for reviews, but I’ve stayed at many airbnbs and this has been by far the most impressive place we’ve stayed!",
        "privateFeedback": "You have a fantastic place! We enjoyed everything about it!",
        "categoryRatings": {
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "LOCATION": 4,
          "ACCURACY": 5,
          "VALUE": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2023-01-17T00:55:33.842Z",
        "rating": 5,
        "comment": "The house was very clean and had everything we needed. The kitchen was well stocked with cooking utensils and spices. They had a Treager grill that was super easy to use. The hot tub was clean and easy to use. Lots of blankets and pillows kept it cozy. The community outdoor pool and spa is two houses away-very close. You can walk to the Polo Grounds through the back entrance-about 30 minute walk (1.5 miles). Getting into the gated community can get backed up at busy times, so allow for that. Technically you can’t get out of the back/resident entrance but you can slip out behind another car when they leave…\nOverall, the hosts were very responsive and great! Thanks!",
        "privateFeedback": "Thanks for letting us check out late! Very helpful! \nThe house was great-had everything we needed and so many nice touches, we will definitely keep this in mind for our next trip!",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-01-11T02:04:00.923Z",
        "rating": 5,
        "comment": "Nos encanto el lugar súper cómodo y excelente para familia y sobre todo excelente comunicación con el anfitrión",
        "privateFeedback": "💯 % recomendada",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-01-08T07:24:48.959Z",
        "rating": 5,
        "comment": "Eann’s house was great! It was very easy drive to Joshua Tree. The house itself was beautiful. Perfect set up with kids. The jacuzzi in the backyard was great for relaxing at the end of the day. The rooms were large. Plenty of space for a family. The kitchen was well stocked with all the essentials for cooking, coffee, and grilling in the back yard. There were great games for a rainy day. The magnatiles kept our toddler entertained. Thank you for a great stay!",
        "privateFeedback": "Our stay was great! Hope you had a good trip to Scotland. The only thing is that the shower in the primary bedroom drains a little slowly. Thanks so much for a great trip!",
        "categoryRatings": {
          "LOCATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2023-01-06T23:06:16.669Z",
        "rating": 0,
        "comment": "Perfect guests , respectful of all my house rules and left my place in a very tidy and clean order. Would highly recommend and welcome back anytime.",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "RESPECT_HOUSE_RULES": 5
        }
      },
      {
        "date": "2023-01-05T15:47:59.209Z",
        "rating": 5,
        "comment": "The Cozy Cactus is a great place to stay. Awesome kitchen, the bbq grill wood pellet traeger was great. I had never used one before, it's griller friendly! The fuzbol table was very entertaining.  Everybody had a great time.  Highly recommended!",
        "privateFeedback": "Thanks guys for letting us stay at your place. Everybody had a great time. Great way, great house to relax & start the New Year!",
        "categoryRatings": {
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2023-01-04T14:06:41.656Z",
        "rating": 0,
        "comment": "Great guests!",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "RESPECT_HOUSE_RULES": 5
        }
      },
      {
        "date": "2022-12-31T21:34:38.144Z",
        "rating": 5,
        "comment": "We loved the cozy cactus.  Beautifully furnished. Very comfortable bed. Had everything we needed for our stay. Eann was very responsive to our needs. We would definitely book again.",
        "privateFeedback": "Thank you, Eann. Our Xmas wasn't  what we expected as our family wasn't able to join us as planned. But the house was so beautiful and comfortable we were able to enjoy ourselves.  Thank you so much",
        "categoryRatings": {
          "ACCURACY": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "LOCATION": 4
        }
      },
      {
        "date": "2022-12-31T06:51:39.103Z",
        "rating": 5,
        "comment": "I can't enough great things about our stay. Really well decorated, clean, comfy beds, spacious, great amenities, responsive host...an all around wonderful experience. Would definitely stay here again. Thanks for having us!",
        "privateFeedback": "",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "COMMUNICATION": 5,
          "LOCATION": 4,
          "ACCURACY": 5,
          "VALUE": 4
        }
      },
      {
        "date": "2022-12-25T04:28:05.848Z",
        "rating": 5,
        "comment": "The place was perfect to our liking. My 2 girls in their 20’s to a teenage boy to the rest of us in our 50’s to 60’s were very impressed by the beautiful house and all the amenities it had to offer. We loved it all. All I can say was it was just perfect! Thank you!",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2022-12-20T03:08:26.842Z",
        "rating": 5,
        "comment": "Lovely house, really homely feel and beautiful touches. Eann was quick to respond and helpful! Location was just out of the city centre in a very cosy area avoiding the main bustle. Thank you Eann!",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2022-12-08T15:03:03.814Z",
        "rating": 5,
        "comment": "Just got back from a truly amazing stay! Eann was a wonderful host from beginning to end. She answered all my questions so quickly and thoroughly. The house was spotless and so thoughtfully stocked with great amenities. I drive a Tesla and the charger in the garage made it so convenient. Everyone in my group mentioned they slept very well as the beds were new and very comfortable. I wouldn’t hesitate to recommend Eann’s place to all my family and friends. Thank you again!",
        "privateFeedback": "Your house was exactly what we needed. A great sanctuary away from the other house filled with 14 year old boys. I can’t think of what you need to improve. It was great.",
        "categoryRatings": {
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2022-12-03T21:46:33.100Z",
        "rating": 5,
        "comment": "This house is amazing! It fits the needs of families and friends. The rooms are spacious and very comfortable. Everything is neat and very clean. Eann was super helpful before, during, and after our stay. She is a very attentive host!",
        "privateFeedback": "The house is perfect! The rooms are comfortable. The decorations are great. We loved the books on the table. It was nice to see that you had things set up for families. The drawer with the coffee pods and creamer was amazing!! We loved everything about the space!",
        "categoryRatings": {
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2022-11-28T12:41:04.075Z",
        "rating": 5,
        "comment": "Lovely stay. Beautiful house. Very responsive host.",
        "privateFeedback": "Thank you for having us! We had a great time",
        "categoryRatings": {
          "LOCATION": 3,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "VALUE": 4,
          "ACCURACY": 4,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2022-11-28T03:22:17.985Z",
        "rating": 5,
        "comment": "Lovely stay at the cozy cactus. Home is extremely well organized and cared for. We had everything we needed. Eann is a great host. The layout is idea for families or 2 couples. Furniture and bedding seemed brand new. Only suggestion is some detail on the pool and tennis location within the condo area. One pool is super close but we weren’t sure which other ones we could use. Overall, a top notch experience.",
        "privateFeedback": "",
        "categoryRatings": {
          "ACCURACY": 5,
          "CLEANLINESS": 5,
          "LOCATION": 4,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2022-11-21T01:01:13.673Z",
        "rating": 5,
        "comment": "Very beautiful home. We felt very welcomed and the communication was excellent.",
        "privateFeedback": "",
        "categoryRatings": {
          "ACCURACY": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2022-11-19T12:59:23.366Z",
        "rating": 5,
        "comment": "Really nice house in a really nice neighborhood",
        "privateFeedback": "Thanks so much!!",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2022-11-14T00:22:32.394Z",
        "rating": 5,
        "comment": "The host was wonderful.  Everything was seamless from check-in to checking out.  Very inviting home with lovely decor.  Safe neighborhood centrally located for what we needed.  Highly recommend!",
        "privateFeedback": "Thank you for a wonderful place to stay.  Loved the decor!",
        "categoryRatings": {
          "CHECKIN": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "LOCATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2022-11-09T03:59:19.499Z",
        "rating": 5,
        "comment": "Eann was super communicative and responsive to our questions - such an easy and smooth experience!!!!",
        "privateFeedback": "Thank you for accommodating our changes - super communicative",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "VALUE": 5
        }
      },
      {
        "date": "2022-11-04T22:44:43.013Z",
        "rating": 5,
        "comment": "We absolutely loved staying here! We were in town for a family matter and having a comfortable and clean place to stay was exactly what we needed. The house was just right for my 2-year-old as well.  The neighborhood feels very safe and it was centrally located to everything we needed to do during our stay. Eann is an excellent communicator and quick to respond. We would absolutely stay here again!",
        "privateFeedback": "",
        "categoryRatings": {
          "LOCATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2022-11-02T20:25:09.241Z",
        "rating": 5,
        "comment": "First of all, WOW. \nSecond of all, I will never give another place a 5 star review unless it lives up to the experience I had at Eann's Cozy Cactus. \n\nI was in town for a work conference and my sisters and mom met me there for a short girls' trip. Eann was very flexible with booking the reservation as I had to change the dates slightly and then also needed early check in as we were headed out to hike in Joshua Tree.\n\nThe photos in the listing are marvelous but the house is EVEN BETTER than the photos. There is not one detail that was not thought of. Eann even has recommendations for food or drinks in the area. We went to five out of ten of them, none of them disappointed. One of the taco shops was rated the top taco shop of Coachella this year as well. \n\nOverall just the best experience any of us have had staying at an Airbnb and it made the week just that much better. If there is ever a reason for me to be staying near Palm Springs again, I would not consider staying anywhere else.",
        "privateFeedback": "Eann, THANK YOU. This was seriously the best stay I have had with any Airbnb. I hope I have a reason to come back to Palm Springs area again to stay here. We really appreciate how responsive you were with communication, the flexibility with needing to change the dates a little and adding the early check in. Your PDF of instructions was so helpful and made check in and out so smooth and easy. Every drink or food recommendation was great. And it's a very small detail, but not having a fee for turning on the hot tub was a huge deal. All of the other places we looked at had such outrageous fees to have the hot tub turned on and we just wanted to be able to hang out at the end of the day.",
        "categoryRatings": {
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2022-10-24T22:07:50.380Z",
        "rating": 5,
        "comment": "The Cozy Cactus is lovely. Super clean. Well-decorated… lots of places look nice like this but everything is actually super cheap quality… this place is quality. So many thoughtful touches that really make it delightful. The neighborhood is decent and quiet. The pool is nothing special, but decent and super close. All communication was super timely and thorough. Only sad that we’ll probably never be able to stay at this price again because it’s sure to become too popular!!",
        "privateFeedback": "",
        "categoryRatings": {
          "CHECKIN": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2022-10-18T03:16:30.846Z",
        "rating": 5,
        "comment": "Extremely clean, communicative, and beautifully designed home. Check in was a breeze, and beds were so comfortable. Also the shower was extremely hot and has great water pressure! Can’t wait to come back and stay longer!",
        "privateFeedback": "Extremely clean, communicative, and beautifully designed home. Check in was a breeze, and beds were so comfortable. Also the shower was extremely hot and has great water pressure! Can’t wait to come back and stay longer!",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CLEANLINESS": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2022-10-16T23:29:33.279Z",
        "rating": 5,
        "comment": "Eann’s house is beautiful. She really thought of everything, from a Wifi QR code, to a pack n play, sound machine, plenty of towels, entertainment, and even better, it was one of the cleanest places I’ve stayed at. It’s perfect for families - she even has outlet protectors and baby wipes for us to use.\n\nWe were curious about the community pool, since it wasn’t private, but honestly it’s so close - you can literally see it outside of the front door. She even provided pool floaties and noodles to use as well.\n\nShe was super responsive to my messages and extremely accommodating. Can’t wait to come back and try out all of the amenities. If you’re hesitating to book this place, you won’t regret it.",
        "privateFeedback": "Eann’s house is beautiful. She really thought of everything, from a Wifi QR code, to a pack n play, sound machine, plenty of towels, entertainment, and even better, it was one of the cleanest places I’ve stayed at. It’s perfect for families - she even has outlet protectors and baby wipes for us to use.\n\nWe were curious about the community pool, since it wasn’t private, but honestly it’s so close - you can literally see it outside of the front door. She even provided pool floaties and noodles to use as well.\n\nShe was super responsive to my messages and extremely accommodating. Can’t wait to come back and try out all of the amenities. If you’re hesitating to book this place, you won’t regret it.",
        "categoryRatings": {
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2022-10-10T02:13:10.132Z",
        "rating": 5,
        "comment": "We absolutely loved staying here! Such a well decorated and comfortable place. The space was perfect for my family and they were so thoughtful. They saw that we were traveling with an infant and put out the pack n’play along with a sound machine. Next time we go this will be my first choice!",
        "privateFeedback": "Thank you for everything! We absolutely loved staying there. It was such a comfortable stay. We loved the decor, and everything was so thoughtful and detailed. \nHope to stay there again!",
        "categoryRatings": {
          "VALUE": 5,
          "CLEANLINESS": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2022-10-08T01:55:27.129Z",
        "rating": 5,
        "comment": "Super nice, nicely furnished… recommend",
        "privateFeedback": "Really nice & totally furnished",
        "categoryRatings": {
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "CHECKIN": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2022-09-19T18:58:36.001Z",
        "rating": 5,
        "comment": "This is the cutest and perfect house for a nice getaway from it all! The house was immaculate, and so cozy. We planned a last min trip and Brandon was super helpful and prompt in responding to our messages. The spa was so nice and relaxing. We can’t wait to come back  for a longer  stay to enjoy the other amenities like the bbq/smoker, the patio area and pool.",
        "privateFeedback": "We really appreciated his responsiveness in communication we had  a small snag with the front door but we came to a quick solution. I really can’t say enough about how well stocked the house was, we didn’t stay long enough to use the smoker or enjoy the patio so we will be back.",
        "categoryRatings": {
          "CHECKIN": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2022-09-08T23:07:43.776Z",
        "rating": 5,
        "comment": "Place was beautiful, peaceful, private and had everything you need to enjoy your stay. Check in and check out were simple and easy. I’d recommend this place to a small group of friends or a family.",
        "privateFeedback": "Place was great! We truly enjoyed the space for the night. \nOnly a couple of things: \n1. blankets in the master closet smelled like dogs and had dog hair on a few of them. \n2. Recommend a Bluetooth speaker. ⭐️\n\nI won’t put that in my public review bc I thought the place was great. Wish we could have stayed a couple extra days.",
        "categoryRatings": {
          "CHECKIN": 5,
          "LOCATION": 5,
          "CLEANLINESS": 5,
          "VALUE": 5,
          "COMMUNICATION": 5,
          "ACCURACY": 5
        }
      },
      {
        "date": "2022-08-13T21:48:47.942Z",
        "rating": 5,
        "comment": "This place is SO clean, has extremely comfortable beds, and lots of fresh towels. This was a last minute booking and the hosts were quick to respond. The place looks even better in person with great design. The furniture is super high quality and the couch is SO NICE. Their coffee setup is also very generous, with a French Press, a Keurig, and a drip coffee pot depending on what kind of coffee you like. Usually you only see a keurig.\n\nIf you're looking for a sign to book this property, this is it. I only wish I had more time to stay and enjoy the space.",
        "privateFeedback": "This place is SO clean, has extremely comfortable beds, and lots of fresh towels. This was a last minute booking and the hosts were quick to respond. The place looks even better in person with great design. The furniture is super high quality and the couch is SO NICE. Their coffee setup is also very generous, with a French Press, a Keurig, and a drip coffee pot depending on what kind of coffee you like. Usually you only see a keurig.\n\nIf you're looking for a sign to book this property, this is it. I only wish I had more time to stay and enjoy the space.",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "ACCURACY": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2022-08-13T00:25:57.799Z",
        "rating": 5,
        "comment": "AMAZING place and so beautiful! Everything was extremely well thought out, from the Wi-Fi QR code to the cacti design elements throughout. I stayed in the third bedroom, and they even had light switches under the sconces on the wall with USB ports to plug my chargers in directly. So convenient and so thoughtful. \n\nI’m so glad I took a chance on this Airbnb, and can’t wait to come back and bring my family or girlfriends for a girls trip. Also the location is beautiful, with the desert view and the palm trees. It’s located in a quiet and beautiful neighborhood. Thank you Brandon and Eann!",
        "privateFeedback": "AMAZING place and so beautiful! Everything was extremely well thought out, from the Wi-Fi QR code to the cacti design elements throughout. I stayed in the third bedroom, and they even had light switches under the sconces on the wall with USB ports to plug my chargers in directly. So convenient and so thoughtful. \n\nI’m so glad I took a chance on this Airbnb, and can’t wait to come back and bring my family or girlfriends for a girls trip. Also the location is beautiful, with the desert view and the palm trees. It’s located in a quiet and beautiful neighborhood. Thank you Brandon and Eann!",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "LOCATION": 5,
          "CHECKIN": 5
        }
      },
      {
        "date": "2022-08-12T16:10:47.361Z",
        "rating": 5,
        "comment": "Eann and Brandon were wonderful hosts! They both were extremely communicative and accommodating before and during our stay in The Cozy Cactus. This place is so cute and everything was thought of when it came to the amenities. They even have a QR code that connects you automatically to their wifi! The AC worked wonderfully in the middle of the desert heat and check in with the smart lock was so easy. We also felt super safe in the gated community. We enjoyed escaping in the beautiful community pool, which is literally a 1 minute walk away. Even better though, the private jacuzzi on the patio was so relaxing at night. Such a great place to stay. The place is perfect for a short weekend trip or a long stay. Highly recommend!",
        "privateFeedback": "Thank you so much for a lovely stay! We had a great time in your beautiful home. Excellent communication!",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "COMMUNICATION": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "ACCURACY": 5,
          "LOCATION": 5
        }
      },
      {
        "date": "2022-08-10T18:02:21.140Z",
        "rating": 5,
        "comment": "“Eann and Brandon’s place was exactly as described. So cozy! I was stunned by the design, cleanliness, and the comfort of the beds. You can tell everything was super intentional, including the USB wall chargers, extension cords everywhere, well stocked Keurig coffee station and kitchen, the beautiful outdoor jacuzzi with a view, and the colorful game room. Plus Brandon and Eann were extremely responsive and accommodating hosts.\n\nI will be sure to stay at The Cozy Cactus next time I’m in town. Plus the location can’t be beat for any future Coachella festivals. We can’t wait to come back. Thank you so much!”",
        "privateFeedback": "Thanks for accommodating me so quickly and the edited rate. I really appreciate it!",
        "categoryRatings": {
          "CLEANLINESS": 5,
          "ACCURACY": 5,
          "VALUE": 5,
          "CHECKIN": 5,
          "LOCATION": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2019-12-24T00:23:43.767Z",
        "rating": 0,
        "comment": "Up front open communication with me about there arrival time.  Any questions was answered right away.",
        "privateFeedback": "You can consider us again in the future travels.  Thanks again",
        "categoryRatings": {
          "RESPECT_HOUSE_RULES": 4,
          "COMMUNICATION": 5,
          "CLEANLINESS": 4
        }
      },
      {
        "date": "2019-09-21T17:31:40.000Z",
        "rating": 5,
        "comment": "Eann was a great guest and is recommended to all hosts!",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "CLEANLINESS": 5,
          "RESPECT_HOUSE_RULES": 5
        }
      },
      {
        "date": "2019-06-08T02:02:41.000Z",
        "rating": 0,
        "comment": "Eann was a great guest.  Clean, quiet, communicated well and took great care of our place.  I would be happy to have her return.",
        "privateFeedback": "",
        "categoryRatings": {
          "RESPECT_HOUSE_RULES": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2019-04-30T17:22:14.000Z",
        "rating": 0,
        "comment": "Very nice group respecting the rules and very clean",
        "privateFeedback": "thanks girls for your visit",
        "categoryRatings": {
          "RESPECT_HOUSE_RULES": 5,
          "CLEANLINESS": 5,
          "COMMUNICATION": 5
        }
      },
      {
        "date": "2019-04-24T15:19:59.000Z",
        "rating": 0,
        "comment": "Nice guests! Recommended.",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "RESPECT_HOUSE_RULES": 5,
          "CLEANLINESS": 4
        }
      },
      {
        "date": "2018-09-10T08:46:26.000Z",
        "rating": 0,
        "comment": "Bridget left the house very clean and nice.\r\nShe will always be welcome back!",
        "privateFeedback": "",
        "categoryRatings": {
          "RESPECT_HOUSE_RULES": 5,
          "COMMUNICATION": 5,
          "CLEANLINESS": 5
        }
      },
      {
        "date": "2017-11-14T15:47:46.000Z",
        "rating": 0,
        "comment": "Eann a très  bien communiquer pour reservation resto, itinéraire, le temps. Les lieux ont été respectés.  Je recommande.",
        "privateFeedback": "bonjour Eann  soyez plus précise dans vos horaires cela risque de gêner certains hôtes.  sinon tout est bien.",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "RESPECT_HOUSE_RULES": 3,
          "CLEANLINESS": 3
        }
      },
      {
        "date": "2017-11-04T19:33:04.000Z",
        "rating": 5,
        "comment": "Very nice and easy going people, really reccomended to anyone!!",
        "privateFeedback": "",
        "categoryRatings": {
          "COMMUNICATION": 5,
          "RESPECT_HOUSE_RULES": 5,
          "CLEANLINESS": 5
        }
      }
    ]
  },
  "themesByProperty": {
    "Cozy Cactus": {
      "positive": {
        "responsive": 50,
        "stocked": 29,
        "spacious": 15,
        "great": 75,
        "hot tub": 17,
        "labeled": 8,
        "easy": 26,
        "clean": 58,
        "beautiful": 47,
        "perfect": 39,
        "love": 48,
        "wonderful": 29,
        "amenities": 25,
        "comfortable": 33,
        "amazing": 25,
        "recommend": 47,
        "excellent": 9,
        "communication": 12
      },
      "negative": {
        "difficult": 2,
        "improvement": 1,
        "dirty": 3,
        "needs": 4,
        "repair": 2,
        "replace": 3,
        "issue": 4,
        "fix": 1,
        "missing": 1,
        "broken": 1
      },
      "categoryAverages": {
        "VALUE": [
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          3,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5
        ],
        "CHECKIN": [
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5
        ],
        "LOCATION": [
          4,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          4,
          4,
          5,
          5,
          5,
          5,
          3,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5
        ],
        "COMMUNICATION": [
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5
        ],
        "CLEANLINESS": [
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          3,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          3,
          5,
          5,
          4,
          5
        ],
        "ACCURACY": [
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          3,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          4,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5,
          5
        ]
      }
    }
  },
  "stats": {
    "Cozy Cactus": {
      "totalReviews": 191,
      "avgRating": "4.66",
      "categoryAvgs": {
        "VALUE": "4.93",
        "CHECKIN": "4.98",
        "LOCATION": "4.89",
        "COMMUNICATION": "5.00",
        "CLEANLINESS": "4.95",
        "ACCURACY": "4.97"
      },
      "topPositive": [
        [
          "great",
          75
        ],
        [
          "clean",
          58
        ],
        [
          "responsive",
          50
        ],
        [
          "love",
          48
        ],
        [
          "beautiful",
          47
        ],
        [
          "recommend",
          47
        ],
        [
          "perfect",
          39
        ],
        [
          "comfortable",
          33
        ],
        [
          "stocked",
          29
        ],
        [
          "wonderful",
          29
        ]
      ],
      "topNegative": [
        [
          "needs",
          4
        ],
        [
          "issue",
          4
        ],
        [
          "dirty",
          3
        ],
        [
          "replace",
          3
        ],
        [
          "difficult",
          2
        ]
      ],
      "recentReviews": [
        {
          "date": "2026-01-04T15:12:52.165Z",
          "rating": 5,
          "comment": "The Cozy Cactus is indeed cozy 😀. A spacious house that's tastefully decorated, refreshingly free of the usual cheap or chintzy furnishings found in other Airbnb rentals. It's well stocked with supplies.\n\nEverything is well labeled so easy to find what we need. The hot tub was great with the cool weather.\n\nEann is a super host, very accommodating and helpful, and extremely responsive.  Average Response Time is given as one hour, but in reality, averaged less than a minute!\n\nIf you're planning to attend Coachella, and do things around La Quinta, Palm Desert, etc, this is a super location. We did a lot in Palm Springs and the drive was somewhat too long to be convenient (averaged 50 min to an hour)\n\nProperty is within a gated community so felt very safe. It has pools, fitness center and even pickleball courts. Getting in and out of the security gate was easy. We did not have any issues as shared in some reviews.\n\nWe had a great stay.",
          "privateFeedback": "A few things that can use some improvements:\n- the sliding glass doors and screens (from both kitchen and MBR) to the backyard are difficult to open and close. Something wrong with the sliding mechanism. \n- The smoker is great but would be easier and quicker with a gas grill.\n- the hot tub is great and clean but water should be drained and tub refilled. It was very foamy from water not being changed out. Monitor indicated age of water!\n- the curtain rod in MBR (by sliding glass door) kept falling down when we opened and closed curtains\n- would be helpful to have more towel rods in bathrooms for wet towels",
          "categoryRatings": {
            "VALUE": 5,
            "CHECKIN": 5,
            "LOCATION": 4,
            "COMMUNICATION": 5,
            "CLEANLINESS": 5,
            "ACCURACY": 5
          }
        },
        {
          "date": "2025-12-27T00:13:13.480Z",
          "rating": 5,
          "comment": "The house is beautiful! It is just as pictured, even better in person. Had everything we needed, easy to find, everything in the home is labeled and in a proper place. Very clean and cute decor and set up, perfect for our family!",
          "privateFeedback": "Thank you for a great stay!  Great communication and information.",
          "categoryRatings": {
            "VALUE": 5,
            "CLEANLINESS": 5,
            "CHECKIN": 5,
            "ACCURACY": 5,
            "COMMUNICATION": 5,
            "LOCATION": 4
          }
        },
        {
          "date": "2025-12-26T01:02:01.957Z",
          "rating": 5,
          "comment": "I can't think of a better Airbnb experience and a nicer host who was always available if you needed something or had any questions. Thankyou very much, Eann.",
          "privateFeedback": "Hi Eann. We had a wonderful time. Your rapid responses were welcome. Please take care, and Happy New Year in advance \n\nOn a side note, I saw part of your name, Tuan,  and thought that perhaps you have Vietnamese ancestry. I lived in Asia as a teacher for more than 40 years, and Vietnam 7. years. Anyway, I try to put names with countries.\n\nThankyou again, Eann.",
          "categoryRatings": {
            "LOCATION": 5,
            "COMMUNICATION": 5,
            "VALUE": 5,
            "CLEANLINESS": 5,
            "CHECKIN": 5,
            "ACCURACY": 5
          }
        },
        {
          "date": "2025-12-24T04:31:56.039Z",
          "rating": 5,
          "comment": "Eann is a wonderful host, very responsive and kind. The house is also great, exactly like in the photos and description. we loved all the amenities, hot tub, mini golf and just everything. The shared swimming pool and pickleball were great fun for the whole family. We will definitely come back if we are in the area again!",
          "privateFeedback": "",
          "categoryRatings": {
            "VALUE": 5,
            "COMMUNICATION": 5,
            "CLEANLINESS": 5,
            "LOCATION": 5,
            "ACCURACY": 5,
            "CHECKIN": 5
          }
        },
        {
          "date": "2025-12-18T03:29:02.513Z",
          "rating": 5,
          "comment": "The location was great, and it was very comfortable to use. The TV was large, and there were good seasonings and utensils well prepared for cooking.",
          "privateFeedback": "",
          "categoryRatings": {
            "LOCATION": 5,
            "CLEANLINESS": 5,
            "COMMUNICATION": 5,
            "CHECKIN": 5,
            "VALUE": 5,
            "ACCURACY": 5
          }
        },
        {
          "date": "2025-12-12T05:31:38.277Z",
          "rating": 5,
          "comment": "This lovely place had everything we needed. The heated pool was a hit with our family, and the comfortable, clean, and well-stocked apartment made it a great place to stay. The location is also great, being close to shops and a grocery store, and a short drive to downtown Palm Springs. Highly recommended if you’re visiting Palm Springs.",
          "privateFeedback": "Thanks again for having us Eann.",
          "categoryRatings": {
            "LOCATION": 5,
            "CLEANLINESS": 5,
            "VALUE": 5,
            "CHECKIN": 5,
            "ACCURACY": 5,
            "COMMUNICATION": 5
          }
        },
        {
          "date": "2025-12-11T05:16:25.872Z",
          "rating": 5,
          "comment": "The best host I've had so far! Amazing from start to finish thank you so much! We will be back soon!",
          "privateFeedback": "Thank You! So much for for everything, you have been wonderful thank you!",
          "categoryRatings": {
            "ACCURACY": 5,
            "LOCATION": 5,
            "COMMUNICATION": 5,
            "VALUE": 5,
            "CHECKIN": 5,
            "CLEANLINESS": 5
          }
        },
        {
          "date": "2025-12-03T13:50:14.586Z",
          "rating": 5,
          "comment": "We had a great stay at Eann’s place! Beautiful home with lots of amenities. The kitchen was very well stocked which allowed us to celebrate a great Thanksgiving. And my toddler loved the mini golf green in the backyard. Thank you for a wonderful stay!",
          "privateFeedback": "Thank you for a great stay! We had a blast!",
          "categoryRatings": {
            "ACCURACY": 5,
            "CLEANLINESS": 5,
            "VALUE": 4,
            "CHECKIN": 5,
            "LOCATION": 5,
            "COMMUNICATION": 5
          }
        },
        {
          "date": "2025-12-03T00:04:44.853Z",
          "rating": 5,
          "comment": "Very nice place, the host is very welcoming and attentive i would stay again",
          "privateFeedback": "",
          "categoryRatings": {
            "COMMUNICATION": 5,
            "VALUE": 5,
            "LOCATION": 5,
            "CLEANLINESS": 5,
            "CHECKIN": 5,
            "ACCURACY": 5
          }
        },
        {
          "date": "2025-11-20T02:54:23.112Z",
          "rating": 5,
          "comment": "Eann’s home in Indio was perfect for our family of 5! We have young kids and her house was stocked with everything you could need for babies (changing table, high chair, pack n play, etc.) and even had some fun toys and games for our toddlers. The house was very well appointed and had everything we needed from kitchen appliances to coffee to laundry pods. The community was beautiful, had fun pools and was near by to many local attractions. Eann was incredibly responsive and helpful. 10/10 would recommend!",
          "privateFeedback": "Thanks Eann for the fabulous stay! If we ever come back to Indio we would absolutely seek out your house again. It didn’t feel like a cheap Airbnb flip, it really felt like a home and was perfectly cozy, close to things and full of fun stuff for the kids. Appreciate you helping us with guests/gate lists and being so understanding about the pack n play situation.",
          "categoryRatings": {
            "COMMUNICATION": 5,
            "LOCATION": 5,
            "CLEANLINESS": 5,
            "ACCURACY": 5,
            "CHECKIN": 5,
            "VALUE": 5
          }
        }
      ]
    }
  },
  "generatedAt": "2026-01-12T05:25:10.524Z"
}